var files_path = "https://texno-proekt.ru/calc/",
    no_foto_img = files_path + "images/nofoto-icon.png",
    currency = "руб.";
jQuery(function(b) {
    var p = ["LV", "HIWATCH", "HIKVISION"],
        c = {
            ip: {},
            analog: {},
            hd: {}
        },
        m = 0,
        r = [],
        y = 0,
        z = 0;
    b.alerts.cancelButton = "&nbsp;Отмена&nbsp;";
    b(".head-logo").after('<div class="col-lg-9 col-sm-9 col-xs-9 head-res-price" style="display: none;"><div class="calc-solutions-result">Итого: <span class="total_sum">0</span> руб.</div></div>');
    b(window).scroll(function() {
        var c = b("#wrapper-calc").height();
        b("#wrapper-calc").offset();
        b(window).scrollTop() > b("#wrapper-calc").offset().top && b(window).scrollTop() < b("#wrapper-calc").offset().top + c ? (b(".head-logo").addClass("hide-mobile"), b(".head-cart").addClass("hide-mobile"), b(".head-res-price").addClass("mob-show")) : (b(".head-logo").removeClass("hide-mobile"), b(".head-cart").removeClass("hide-mobile"), b(".head-res-price").removeClass("mob-show"))
    });
    	h = [{
        "0": {
            "0": {
                "id": 1,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I202",
                "description": "2Мп купольная мини IP-камера с ИК-подсветкой до 30м\n1/2.8'' Progressive Scan CMOS матрица; механический ИК-фильтр; 0.01Лк@F1.2; DWDR; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-2Мб/с; IP67; IK10; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 5Вт макс. 2Мп уличная купольная мини IP-камера с ИК-подсветкой до 30м",
                "img": "ds-i202.jpg",
                "type": 1,
                "units": "шт",
                "price": 5820,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I252S",
                "description": "2Мп внутренняя купольная IP-камера с ИК-подсветкой до 30 метров построена на 1/2.7' Progressive Scan CMOS. Объектив 2.8мм; угол обзора 114°. Механический ИК-фильтр. Чувствительность 0.01Лк F1.2. Формат видеосжатия H.265/H.265+/H.264/H.264+/MJPEG, динамик/микрофон",
                "img": "ds-i202.jpg",
                "type": 1,
                "units": "шт",
                "price": 7910,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I203",
                "description": "2Мп уличная IP-камера с EXIR-подсветкой до 30м\n1/2.8'' Progressive Scan CMOS матрица; объектив 2.8мм; угол обзора 95°; механический ИК-фильтр; 0.01Лк@F1.2; DWDR; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-2Мб/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 6Вт макс. 2Мп уличная IP-камера с EXIR-подсветкой до 30м",
                "img": "ds-i203.jpg",
                "type": 1,
                "units": "шт",
                "price": 5820,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-252W",
                "description": "2Мп внутренняя купольная IP-камера c EXIR-подсветкой до 30м и WiFi\n1/2.8'' CMOS матрица; механический ИК-фильтр; 0.025лк @F1.2; H.265/H.264, DWDR, 3D DNR, BLC; встроенный микрофон; видеобитрейт 32кб/с -8Мб/с; -20°C ...+60°C; 12В ±25%; 5Вт макс.",
                "img": "ds-i252w.jpg",
                "type": 1,
                "units": "шт",
                "price": 8790,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I206 (2.8-12 mm)",
                "description": "2Мп уличная купольная IP-камера с ИК-подсветкой до 30м\n1/2.8'' Progressive Scan CMOS матрица; вариообъектив 2.8-12мм; угол обзора 100°-35°; механический ИК-фильтр; 0.01Лк@F1.2; WDR (120dB); 3D DNR; BLC; Smart ИК; встроенный слот для microSD карты до 128Гб; видеобитрейт 32кб/с-2Мб/с; IP67; IK10; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7.5Вт макс.",
                "img": "ds-i206_(2.8-12_mm).jpg",
                "type": 1,
                "units": "шт",
                "price": 11540,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I402 (2.8 mm)",
                "description": "4Мп уличная купольная IP-камера с ИК-подсветкой до 30м\n1/3'' Progressive Scan CMOS матрица; 20 к/с @ (2688?1520, 2304?1296), 25 к/с @(1920?1080, 1280?720), H.264+/H.264/MJPEG, объектив 2.8мм; угол обзора 105°; механический ИК-фильтр; 0.01Лк@F1.2; DWDR; ROI; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-16Мб/с; IP67; IK10; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 5,5Вт макс.",
                "img": "cmip7042-28.jpg",
                "type": 1,
                "units": "шт",
                "price": 8020,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Купольные",
                "manufacturer": "HiWatch",
                "name": "DS-I402 (4 mm/6mm)",
                "description": "4Мп уличная купольная IP-камера с ИК-подсветкой до 30м\n1/3'' Progressive Scan CMOS матрица; 20 к/с @ (2688?1520, 2304?1296), 25 к/с @(1920?1080, 1280?720), H.264+/H.264/MJPEG, ; механический ИК-фильтр; 0.01Лк@F1.2; DWDR; ROI; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-16Мб/с; IP67; IK10; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 5,5Вт макс.",
                "img": "cmip7042-28.jpg",
                "type": 1,
                "units": "шт",
                "price": 8020,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "7": {
                "id": 8,
                "group": "Купольные",
                "manufacturer": "Hikvision",
                "name": "DS-2CD2122FWD-IS",
                "description": "2 Мп купольная IP-камера; 1/ 2.8\" Progressive Scan CMOS; 1920х1080 - 25к/с; 2.8 мм;  0.01/0 Лк; ИК-подсветка 10 м; H.264+/H.264/MJPEG, WDR 120дБ; 3D DNR; BLC; Тревожные вх/вых; Аудио вх/вых; MicroSD до 128Гб; 12В/PoE; 5 Вт; IP67; IK10; -40...+60°C; 111x82 мм.",
                "img": "ds-2cd2122fwd-is.jpg",
                "type": 1,
                "units": "шт",
                "price": 10990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Купольные"
        },
        "1": {
            "0": {
                "id": 9,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I250",
                "description": "2Мп уличная цилиндрическая IP-камера с EXIR-подсветкой до 30м\n1/2.8'' Progressive Scan CMOS матрица; объектив 4мм; угол обзора 86°; механический ИК-фильтр; 0.01Лк@F1.2; H.265+/H.264+/MJPEG, DWDR; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-8Мб/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7Вт макс.",
                "img": "ds-i200.jpg",
                "type": 1,
                "units": "шт",
                "price": 6590,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 10,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I206 (2.8-12 mm)",
                "description": "2Мп уличная цилиндрическая IP-камера с ИК-подсветкой до 30м\n1/2.8'' Progressive Scan CMOS матрица; вариообъектив 2.8-12мм; угол обзора 100°-35°; механический ИК-фильтр; 0.01Лк@F1.2; H.264+/MJPEG, WDR (120dB); 3D DNR; BLC; ROI, Smart ИК; строенный слот для microSD карты до 128Гб; видеобитрейт 32кб/с-8Мб/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7.5Вт макс.",
                "img": "ds-i200.jpg",
                "type": 1,
                "units": "шт",
                "price": 12640,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "2": {
                "id": 11,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I100",
                "description": "1Мп уличная цилиндрическая IP-камера с ИК-подсветкой до 30м\n1/4'' Progressive Scan CMOS матрица; механический ИК-фильтр; 0.01Лк@F1.2; H.264/MJPEG, DWDR; 3D DNR; BLC; EXIR Smart ИК; видеобитрейт 32кб/с - 2Мб/с; IP67; -40°C до +60°C; 12В ±25%/PoE (802.3af); 5Вт макс",
                "img": "ds-i200.jpg",
                "type": 1,
                "units": "шт",
                "price": 4280,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "3": {
                "id": 12,
                "group": "Уличные",
                "manufacturer": "Hikvision",
                "name": "DS-2CD2022WD-I",
                "description": "2 Мп уличная IP-камера; 1/2.8” progressive scan CMOS; 1920х1080 - 25 к/с; 4 мм; 0.01 лк; ИК подсветка 30 м; ONVIF, PSIA, CGI, ISAPI;  IP67; 12 DC/РоЕ, 5 Вт; -40 …+60 °C; 60.4х76.9х139.28 мм.",
                "img": "ds-2cd2022wd-i.jpg",
                "type": 1,
                "units": "шт",
                "price": 10990,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "def": "1o,2o,3o,4o,5o,6o,7o,8o",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "4": {
                "id": 13,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I250W",
                "description": "2Мп уличная цилиндрическая IP-камера c EXIR-подсветкой до 30м и WiFi\n1/2.8'' CMOS матрица; объектив 2.8мм; угол обзора 114°; механический ИК-фильтр; 0.025лк @F1.2; H.265/H.264, DWDR, 3D DNR, BLC; встроенный микрофон; видеобитрейт 32кб/с -8Мб/с; -30°C ...+60°C; 12В ±25%; 5Вт макс.2Мп уличная цилиндрическая IP-камера c EXIR-подсветкой до 30м и WiFi",
                "img": "ds-i250w.jpg",
                "type": 1,
                "units": "шт",
                "price": 7910,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "5": {
                "id": 14,
                "group": "Уличные",
                "manufacturer": "Hikvision",
                "name": "CS-CV310-A0-3B1WFR",
                "description": "1Мп внешняя Wi-Fi камера c ИК-подсветкой до 30м \n1/4'' CMOS матрица; объектив 2.8мм; угол обзора 108°; ИК-фильтр; 0.02лк @F2.0; DWDR, 3D DNR; встроенный микрофон и динамик; встроенная сирена 100db; поддержка microSD до 128 Гб; внешние Wi-Fi антенны; IP66; -30°C ...+60°C; 6Вт макс.",
                "img": "ds-i250w.jpg",
                "type": 1,
                "units": "шт",
                "price": 6300,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "6": {
                "id": 15,
                "group": "Уличные",
                "manufacturer": "Hikvision",
                "name": "CS-CV310-A0-1B2WFR",
                "description": "2Мп внешняя Wi-Fi камера c ИК-подсветкой до 30м \n1/2.7'' CMOS матрица; объектив 2.8мм; угол обзора 118°; ИК-фильтр; 0.02лк @F2.0; DWDR, 3D DNR; встроенный микрофон и динамик; встроенная сирена 100db; поддержка microSD до 128 Гб; внешние Wi-Fi антенны; IP66; -30°C ...+60°C; 6Вт макс.",
                "img": "ds-i250w.jpg",
                "type": 1,
                "units": "шт",
                "price": 6990,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "7": {
                "id": 16,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I400",
                "description": "4Мп уличная цилиндрическая IP-камера с EXIR-подсветкой до 30м\n1/3'' Progressive Scan CMOS матрица; 20 к/с @ (2688?1520, 2304?1296), 25 к/с @(1920?1080, 1280?720); H.265/H.264, механический ИК-фильтр; 0.01Лк@F1.2; DWDR; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-8Мб/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7Вт макс.",
                "img": "cmip8042-28.jpg",
                "type": 1,
                "units": "шт",
                "price": 7910,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "8": {
                "id": 17,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I456 (2.8-12 mm)",
                "description": "4Мп уличная цилиндрическая IP-камера с EXIR-подсветкой до 30м\n1/3'' Progressive Scan CMOS матрица; 20 к/с @ (2688?1520, 2304?1296), 25 к/с @(1920?1080, 1280?720); H.265/H.264, механический ИК-фильтр; 0.01Лк@F1.2; DWDR; 3D DNR; BLC; Smart ИК; видеобитрейт 32кб/с-8Мб/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7Вт макс.",
                "img": "ds-t116.jpg",
                "type": 1,
                "units": "шт",
                "price": 14290,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "9": {
                "id": 18,
                "group": "Уличные",
                "manufacturer": "HiWatch",
                "name": "DS-I450",
                "description": "4Мп уличная цилиндрическая IP-камера с EXIR-подсветкой до 30м\n1/3'' Progressive Scan CMOS матрица; 20 к/с @ (2688?1520, 2304?1296), 25 к/с @(1920?1080, 1280?720); H.265+/H.265/H.264+/H.264/MJPEG,  механический ИК-фильтр; 0.01Лк@F1.2; DWDR; ROI, 3D DNR; BLC; Smart ИК; видеобитрейт 32кбит/с-8Мбит/с; IP67; -40°C до +60°C; DC12В±25%/PoE(IEEE 802.3af); 7Вт макс.",
                "img": "cmip8042-28.jpg",
                "type": 1,
                "units": "шт",
                "price": 8790,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "10": {
                "id": 19,
                "group": "Уличные",
                "manufacturer": "RVI",
                "name": "DS-N201",
                "description": "1,3Мп уличная цилиндрическая мини IP-камера с ИК-подсветкой до 15м",
                "img": "ds-n201.jpg",
                "type": 1,
                "units": "шт",
                "price": 6590,
                "binding": [
                    "102",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "Уличные"
        },
        "2": {
            "0": {
                "id": 20,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "HiWatch",
                "name": "DS-I215",
                "description": "2Мп уличная поворотная IP-камера с EXIR-подсветкой до 100м\n1/3'' Progressive Scan CMOS матрица; объектив 5 - 75мм, 15x; угол обзора объектива 53,8° - 4°; механический ИК-фильтр; H.265/H.264, 0.005лк@F1.6; 1920х1080@25к/с; WDR(120dB), 3D DNR; HLC; EIS; антитуман; BLC; обнаружение движения, вторжения в область и пересечения линии;  встроенный слот для microSD карты до 128Гб; вращение 360°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; наклон -15° - 90°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; видеобитрейт 32кб/с-16Мб/с; IP67; -35°C до +60°C; DC12В/PoE(IEEE 802.3af); 18Вт макс.",
                "img": "ds-i215.jpg",
                "type": 1,
                "units": "шт",
                "price": 32990,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 21,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE2204IW-DE3",
                "description": "IP-камера поворотная 2 Мп скоростная поворотная; 1/2.8\" Progressive Scan CMOS; 1920?1080 - 25 к/с; 2.8-12мм;ZOOM 4X; 0.05/0,005 лк; ИК подсветка 30 м; вращение 350°; H.264/MJPEG/H.264+; DWDR, 3D DNR, HLC, BLC, ROI; microSD 128Гб; Аудиовход/выход 1/1; Тревожные вход/выход 1/1; 12 DC/PoE(802.3af); 12Вт; -10 °C...+50 °C; 125?137 мм",
                "img": "ds-2de2204iw-de3.jpg",
                "type": 1,
                "units": "шт",
                "price": 17990,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "2": {
                "id": 22,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE2204IW-DE3/W",
                "description": "Поворотная IP-камера  2 Мп скоростная поворотная; 1/2.8\" Progressive Scan CMOS; 1920?1080 - 25 к/с; 2.8-12мм;ZOOM 4X; 0.05/0,005 лк; ИК подсветка 20 м; вращение 350°; H.264/MJPEG/H.264+; DWDR, 3D DNR, HLC, BLC, ROI; microSD 256Гб; Аудиовход/выход 1/1; Тревожные вход/выход 1/1; 12 DC/PoE(802.3af); 9Вт; -10 °C...+50 °C; ? 125?137 мм",
                "img": "ds-2de2204iw-de3-w.jpg",
                "type": 1,
                "units": "шт",
                "price": 18490,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "3": {
                "id": 23,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE2A204IW-DE3",
                "description": "Поворотная IP-камера 2 Мп скоростная поворотная; 1/3\" Progressive Scan CMOS; 1920х1080 - 25 к/с; 4-х ЗУМ 2.8-12 мм; 0.005/0.001 лк; ИК подсветка 20 м; H.264/MJPEG/H.264+; WDR 120дБ, 3D DNR, HLC, BLC, ROI; ONVIF; microSD 256Гб; Аудиовход/выход 1/1; 12 DC/PoE (802.3af); 12Вт; -20 °C...+65 °C; IP67; IK10; ? 130.7?101.7мм.",
                "img": "ds-2de2a204iw-de3.jpg",
                "type": 1,
                "units": "шт",
                "price": 14890,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "4": {
                "id": 24,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE2A404IW-DE3",
                "description": "Поворотная IP-камера 4 Мп скоростная поворотная; 1/3\" Progressive Scan CMOS; 2560?1440 - 25 к/с; 4-х ЗУМ 2.8-12 мм; 0.005/0.001 лк; ИК подсветка 20 м; H.265+/H.265/MJPEG; WDR 120дБ, 3D DNR, HLC, BLC, ROI; ONVIF; microSD 256Гб; Аудиовход/выход 1/1; 12 DC/PoE (802.3af); 12Вт; -20 °C...+65 °C; IP67; IK10; ? 130.7?101.7мм.",
                "img": "ds-2de2a404iw-de3.jpg",
                "type": 1,
                "units": "шт",
                "price": 16890,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "5": {
                "id": 25,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE5220IW-AE",
                "description": "Поворотная IP-камера 2 Мп уличная скоростная поворотная; 1/2.8’’ Progressive Scan CMOS; 1920х1080 - 25 к/с; 4.7 - 94мм, 20x; ИК-фильтр; 0.02 лк; ИК подсветка 150 м; H.264/MJPEG; DWDR, 3D DNR, BLC, антитуман, ROI; 360°, вручную: 0.1° - 400°/с, по предустановке: 400°/с; наклон -15° - 90°, вручную: 0.1° - 200°/с, по предустановке: 200°/с; microSD 128 Гб; Аудиовход/выход 1/1; Тревожные вход/выход 2/1; 24 ACВ/PoE+; 32Вт макс.; -40 °C...+65 °C; IP66; грозозащита TVS 4000B;",
                "img": "ds-2de5220iw-ae.jpg",
                "type": 1,
                "units": "шт",
                "price": 55990,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "6": {
                "id": 26,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DE5432IW-AE",
                "description": "Поворотная IP-камера 4Мп скоростная поворотная ИК-подсветкой до 150м, объектив 4.8 - 153мм, 32X, 16х цифровое увеличение, 1/2.5\" Progressive Scan CMOS, 0,005/0,001лк, 3D DNR, 120дБ WDR, BLC,AGC, антитуман, H265+/H.265/H.264+/H.264; 25к/с, аудиовход/выход 1/1; тревожный вход/выход 2/1, Smart-аналитика, слот для microSD/SDHC/SDHX до 256Гб, AC 24В/ Hi-PoE,  -40°C... +65°C, IP66, ? 208? 345мм; подавитель напряжения переходных процессов TVS 6000B для грозозащиты.",
                "img": "ds-2de5432iw-ae.jpg",
                "type": 1,
                "units": "шт",
                "price": 69990,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "7": {
                "id": 27,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "Hikvision",
                "name": "DS-2DF7284-AEL",
                "description": "IP 2 Мп уличная скоростная поворотная; 1/2.8’’ Progressive Scan CMOS; 1920х1080 - 25 к/с; 4.7 - 94мм, 20x; 0.03 лк; ИК подсветка 150 м; H.264/MJPEG; DWDR, 3D DNR, BLC, антитуман, ROI; Smart видеоаналитика; вращение 360°, вручную: 0.1° - 160°/с, по предустановке: 240°/с; наклон -2° - 90°, вручную: 0.1° - 120°/с, по предустановке: 200°/с; microSD 128Гб; Аудиовход/выход 1/1; Тревожные вход/выход 7/2; 24 AC/PoE+; 60Вт макс.; PoE+: -40 °C...+65 °C, AC24В: -60 °C...+65 °C; IP66; грозозащита TVS 4000B; 245x399 мм.",
                "img": "ds-2df7284-ael.jpg",
                "type": 1,
                "units": "шт",
                "price": 99990,
                "binding": [
                    "103",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "Скоростные купольные (уличное исполнение)"
        },
        "3": {
            "0": {
                "id": 28,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "Hikvision",
                "name": "CS-C1C-D0-1D2WFR",
                "description": "2Мп внутренняя Wi-Fi камера c ИК-подсветкой до 12м 1/2.9'' CMOS\nматрица; объектив 2.8мм; угол обзора 106°(горизонтальный),\n130°(диагональный);20 к/сек при 1920х1080; ИК-фильтр;2.4ГГц Wi-Fi;\nDWDR; 3DDNR; встроенный микрофон и динамик; обнаружение\nдвижения; H.264, поддержка microSD до 256 Гб; -10°C ...+45°C; DC 5В, 4.0\nВт макс. вес нетто 96г, 64*64*103мм",
                "img": "",
                "type": 1,
                "units": "шт",
                "price": 4990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "def": "1i,2i,3i,4i,5i,6i,7i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "1": {
                "id": 29,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "Hikvision",
                "name": "CS-C1C-D0-1D1WFR",
                "description": "1Мп внутренняя Wi-Fi камера c ИК-подсветкой до 12м 1/4'' CMOS\nматрица; объектив 2.8мм; угол обзора 92°(горизонтальный),\n110°(диагональный);20 к/сек при 1280х720; ИК-фильтр;2.4ГГц Wi-Fi;\nDWDR; 3DDNR; встроенный микрофон и динамик; обнаружение\nдвижения; H.264, поддержка microSD до 256 Гб; -10°C ...+45°C; DC 5В, 4.0\nВт макс. вес нетто 96г, 64*64*103мм",
                "img": "",
                "type": 1,
                "units": "шт",
                "price": 2990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "def": "1i,2i,3i,4i,5i,6i,7i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "2": {
                "id": 30,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "Hikvision",
                "name": "CS-CV246-A0-1C2WFR",
                "description": "2Мп внутренняя поворотная 360° Wi-Fi камера c ИК-подсветкой до 10метров построена на 1/4' CMOS матрице. Объектив 4мм; угол обзора 90°; ИК-фильтр. Чувствительность 0.02лк F2.2; DWDR, 3D DNR",
                "img": "",
                "type": 1,
                "units": "шт",
                "price": 5990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "3": {
                "id": 31,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "HiWatch",
                "name": "DS-I114",
                "description": "1Мп внутренняя IP-камера c ИК-подсветкой до 10м \n1/4'' CMOS матрица; объектив 2.8мм; угол обзора 69°; механический ИК-фильтр; 0.01лк @F1.2; H.264+/H.264/MJPEG, DWDR, 3D DNR, BLC; встроенный микрофон/ динамик; PIR-датчик; обнаружение движения, вторжения в область и пересечения линии; видеобитрейт 32кб/с -8Мб/с; -20°C ...+45°C; 12В ±10%/PoE (802.3af); 5Вт макс.",
                "img": "ds-i214w.jpg",
                "type": 1,
                "units": "шт",
                "price": 6040,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "4": {
                "id": 32,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "HiWatch",
                "name": "DS-I114W",
                "description": "1Мп внутренняя IP-камера c ИК-подсветкой до 10м и Wi-Fi\n1/4'' CMOS матрица; объектив 2.8мм; угол обзора 69°; механический ИК-фильтр; 0.01лк @F1.2; H.264+/H.264/MJPEG, DWDR, 3D DNR, BLC; встроенный микрофон/ динамик; PIR-датчик; обнаружение движения, вторжения в область и пересечения линии; видеобитрейт 32кб/с -8Мб/с; -20°C ...+45°C; 12В ±10%/PoE (802.3af); 5Вт макс.",
                "img": "ds-i214w.jpg",
                "type": 1,
                "units": "шт",
                "price": 7250,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "5": {
                "id": 33,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "HiWatch",
                "name": "DS-I214W",
                "description": "2Мп внутренняя IP-камера c ИК-подсветкой до 10м и WiFi\n1/2.8'' CMOS матрица; механический ИК-фильтр; 0.01лк @F2.0; DWDR, 3D DNR, BLC; встроенный микрофон/ динамик; PIR-датчик; обнаружение движения, вторжения в область и пересечения линии; встроенный слот для microSD карты до 128Гб; видеобитрейт 32кб/с -8Мб/с; -20°C ...+45°C; 12В ±10%/PoE (802.3af); 4,, 5Вт макс.2Мп внутренняя IP-камера c ИК-подсветкой до 10м и WiFi",
                "img": "ds-i214w.jpg",
                "type": 1,
                "units": "шт",
                "price": 8790,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "6": {
                "id": 34,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "HiWatch",
                "name": "DS-I214",
                "description": "2Мп внутренняя IP-камера c ИК-подсветкой до 10м \n1/2.8'' CMOS матрица;  механический ИК-фильтр; 0.01лк @F2.0; DWDR, 3D DNR, BLC; встроенный микрофон/ динамик; PIR-датчик; обнаружение движения, вторжения в область и пересечения линии; встроенный слот для microSD карты до 128Гб; видеобитрейт 32кб/с -8Мб/с; -20°C ...+45°C; 12В ±10%/PoE (802.3af); 4,, 5Вт макс.2Мп внутренняя IP-камера c ИК-подсветкой до 10м",
                "img": "ds-i214.jpg",
                "type": 1,
                "units": "шт",
                "price": 8240,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "7": {
                "id": 35,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "Hikvision",
                "name": "CS-CV206-C0-1A1WFR (С2С 720р)",
                "description": "1Мп внутренняя Wi-Fi камера c ИК-подсветкой до 5м \n1/4'' CMOS матрица; объектив 2.8мм; угол обзора 111°; ИК-фильтр; 0.02лк @F2.2; DWDR, 3D DNR; встроенный микрофон и динамик; обнаружение движения;  поддержка microSD до 128 Гб; -10°C ...+50°C; 3Вт макс.",
                "img": "lv-pwf812-u.jpg",
                "type": 1,
                "units": "шт",
                "price": 3990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "8": {
                "id": 36,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "Hikvision",
                "name": "CS-CV246-A0-3B1WFR",
                "description": "1Мп внутренняя поворотная 360° Wi-Fi камера c ИК-подсветкой до 10метров построена на 1/4' CMOS матрице. Объектив 4мм; угол обзора 90°; ИК-фильтр. Чувствительность 0.02лк F2.2; DWDR, 3D DNR",
                "img": "lv-pwr362-u.jpg",
                "type": 1,
                "units": "шт",
                "price": 4500,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "9": {
                "id": 37,
                "group": "Фиксированные малогабаритные",
                "manufacturer": "LV",
                "name": "LV-PWF604",
                "description": "4Мп внутренняя Wi-Fi камера c ИК-подсветкой до 10м \n1/3'' CMOS матрица; объектив 4 мм; угол обзора 180°; встроенный микрофон и динамик; обнаружение движения;  поддержка microSD до 128 Гб; -10°C ...+50°C; 3Вт макс.",
                "img": "lv-pwf604.jpg",
                "type": 1,
                "units": "шт",
                "price": 9500,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "Фиксированные малогабаритные"
        },
        "4": {
            "0": {
                "id": 38,
                "group": "Wi-Fi камера",
                "manufacturer": "EZVIZ",
                "name": "CS-C1C-D0-1D1WFR",
                "description": "1Мп внутренняя Wi-Fi камера c ИК-подсветкой до 12м 1/4'' CMOS матрица; объектив 2.8мм; угол обзора 92°(горизонтальный), 110°(диагональный);20 к/сек при 1280х720; ИК-фильтр;2.4ГГц Wi-Fi;  DWDR; 3DDNR; встроенный микрофон и динамик; обнаружение движения; H.264, поддержка microSD до 256 Гб; -10°C ...+45°C; DC 5В, 4.0 Вт макс. вес нетто 96г, 64*64*103мм",
                "img": "CS-C1C-D0-1D1WFR.png",
                "type": 1,
                "units": "шт",
                "price": 2990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "1": {
                "id": 39,
                "group": "Wi-Fi камера",
                "manufacturer": "EZVIZ",
                "name": "CS-C1C-D0-1D2WFR",
                "description": "2Мп внутренняя Wi-Fi камера c ИК-подсветкой до 12м 1/2.9'' CMOS матрица; объектив 2.8мм; угол обзора 106°(горизонтальный), 130°(диагональный);20 к/сек при 1920х1080; ИК-фильтр;2.4ГГц Wi-Fi;  DWDR; 3DDNR; встроенный микрофон и динамик; обнаружение движения; H.264, поддержка microSD до 256 Гб; -10°C ...+45°C; DC 5В, 4.0 Вт макс. вес нетто 96г, 64*64*103мм",
                "img": "CS-C1C-D0-1D2WFR.png",
                "type": 1,
                "units": "шт",
                "price": 4990,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "2": {
                "id": 40,
                "group": "Wi-Fi камера",
                "manufacturer": "EZVIZ",
                "name": "CS-CV310-A0-3B1WFR",
                "description": "1Мп внешняя Wi-Fi камера c ИК-подсветкой до 30м \n1/4'' CMOS матрица; объектив 2.8мм; угол обзора 108°; ИК-фильтр;  встроенный микрофон и динамикподдержка microSD до 128 Гб; внешние Wi-Fi антенны; IP66; -30°C ...+60°C;",
                "img": "CS-CV310-A0-3B1WFR.png",
                "type": 1,
                "units": "шт",
                "price": 6300,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "3": {
                "id": 41,
                "group": "Wi-Fi камера",
                "manufacturer": "EZVIZ",
                "name": "C3WN",
                "description": "2Мп внешняя Wi-Fi камера c ИК-подсветкой до 30м \n1/2.7'' CMOS матрица; объектив 2.8мм; угол обзора 118°; ИК-фильтр встроенный микрофон и динамик;поддержка microSD до 128 Гб; внешние Wi-Fi антенны; IP66; -30°C ...+60°C",
                "img": "c3wn.png",
                "type": 1,
                "units": "шт",
                "price": 6500,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "4": {
                "id": 42,
                "group": "Wi-Fi камера",
                "manufacturer": "EZVIZ",
                "name": "C4W",
                "description": "2Мп внешняя купольная Wi-Fi камера c ИК-подсветкой до 30м \n1/2,7'' CMOS матрица; объектив 4мм; угол обзора 107.5°; ИК-фильтр;  поддержка microSD до 128 Гб; IP66;IK10;-30°C ...+60°C",
                "img": "c4w.png",
                "type": 1,
                "units": "шт",
                "price": 7500,
                "binding": [
                    "101",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "name": "Wi-Fi камера"
        },
        "name": "IP-камеры видеонаблюдения",
        "id": 0,
        "type": 1
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "LV-PWR302",
                "description": "Wi-Fi поворотная видеокамера FullHD 1080p, угол обзора 106, ночная съемка до 10 метров",
                "img": "lv_pwr302.jpg",
                "type": 2,
                "units": "шт",
                "price": 7500,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "def": "1i,2i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "CMIP7042-28",
                "description": "4Мп уличная купольная мини IP-камера с EXIR-подсветкой до 30м",
                "img": "cmip7042-28.jpg",
                "type": 2,
                "units": "шт",
                "price": 10990,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "LV-HT1020W",
                "description": "2Мп антивандальная купольная HD-TVI камера с ИК-подсветкой до 20м. 1/2.7\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора 103°(2.8мм), 82.2°(3.6мм), 54°(6мм); механический ИК-фильтр; 0.1 Лк@F1.2; Видеовыход: 1 х HD-TVI; -20°С...+45°С; 12В DC±15%, 4Вт макс.",
                "img": "lv_ht1020w.jpg",
                "type": 2,
                "units": "шт",
                "price": 3070,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "DS-2CD2122FWD-IS",
                "description": "2 Мп купольная IP-камера; 1/ 2.8\" Progressive Scan CMOS; 1920х1080 - 25к/с; 2.8 мм;  0.01/0 Лк; ИК-подсветка 10 м; H.264+/H.264/MJPEG, WDR 120дБ; 3D DNR; BLC; Тревожные вх/вых; Аудио вх/вых; MicroSD до 128Гб; 12В/PoE; 5 Вт; IP67; IK10; -40...+60°C; 111x82 мм.",
                "img": "ds-2cd2122fwd-is.jpg",
                "type": 2,
                "units": "шт",
                "price": 10990,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "RVi-C321 (2.8-12 мм)",
                "description": "Купольная камера; 1/3\" 1.3MP-матрица Aptina AR0130 КМОП; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ;  Объектив: 2.8-12 мм; Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); ИК-подсветка: до 30 метров; Отношение сигнал/шум: 62 дБ; Режим «день-ночь»: Механический ИК-фильтр; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Диапазон рабочих температур: -10°С...+60°С; Габаритные размеры: ?136х101 м; Вес: 0.8 кг; Цвет корпуса: белый Производитель: RVi",
                "img": "rvi-c321-2.8-12-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 4950,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "RVi-C311B (2.8 мм)",
                "description": "Купольная камера; 1/3\" КМОП-матрица 960H Pixel Plus PC1099; Количество \nпикселей по горизонтали и вертикали: 976х496; Разрешение по горизонтали: \n720 ТВЛ;  Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); \nОбъектив; 3.6 мм; ИК-подсветка: до 20 метров; Режим «день-ночь»: \nМеханический ИК-фильтр; Напряжение питания: DC 12 В; Потребление \nтока: не более 350 мА; Диапазон рабочих температур: -10°С...+60°С; \nГабаритные размеры: ?90х70 мм; Вес: 200 г; Цвет корпуса: белый",
                "img": "rvi-c311b (2.8 mm).jpg",
                "type": 2,
                "units": "шт",
                "price": 2530,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "def": "4i,5i,6i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "RVi-C311B (3.6 мм)",
                "description": "Купольная камера; 1/3\" КМОП-матрица 960H Pixel Plus PC1099; Количество пикселей по горизонтали и вертикали: 976х496; Разрешение по горизонтали: 720 ТВЛ;  Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); Объектив; 3.6 мм; ИК-подсветка: до 20 метров; Режим «день-ночь»: Механический ИК-фильтр; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Диапазон рабочих температур: -10°С...+60°С; Габаритные размеры: ?90х70 мм; Вес: 200 г; Цвет корпуса: белый Производитель: RVi",
                "img": "rvi-c311b-3.6-mm-rvi-c321b-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 2530,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "7": {
                "id": 8,
                "group": "Купольные",
                "manufacturer": "RVI",
                "name": "RVi-C321B (3.6 мм)",
                "description": "Купольная камера; 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ;  Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); Объектив; 3.6 мм; ИК-подсветка: до 20 метров; Режим «день-ночь»: Механический ИК-фильтр; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Диапазон рабочих температур: -10°С...+60°С; Габаритные размеры: ?90х70 мм; Вес: 200 г; Цвет корпуса: белый Производитель: RVi",
                "img": "rvi-c311b-3.6-mm-rvi-c321b-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 3300,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Купольные"
        },
        "1": {
            "0": {
                "id": 9,
                "group": "Антивандальные",
                "manufacturer": "RVI",
                "name": "RVi-C321VB (2.8 мм)",
                "description": "Антивандальная камера; Матрица: 1/3\" 1.3MP Aptina AR0130 КМОП-\nматрица; Количество пикселей по горизонтали и вертикали: 1280х960; \nРазрешение по горизонтали: 800 ТВЛ;  Объектив: 2.8 мм; Нижний порог \nчувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); ИК-подсветка: до 20 \nметров; Auto BLC, AWB; Отношение сигнал/шум: 62 дБ; Режим «день-ночь»: \nМеханический ИК-фильтр; Класс защиты: IP66; Напряжение питания: DC 12 \nВ; Потребление тока: не более 350 мА; Диапазон рабочих температур: -\n40…+60°С;  Габаритные размеры: ?90х60 мм; Вес: 400 г",
                "img": "rvi-c321vb (2.8 mm).jpg",
                "type": 2,
                "units": "шт",
                "price": 3300,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "def": "3i,7i,8i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 10,
                "group": "Антивандальные",
                "manufacturer": "RVI",
                "name": "RVi-C321VB (3.6 мм)",
                "description": "Антивандальная камера; Матрица: 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ;  Объектив: 3.6 мм; Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); ИК-подсветка: до 20 метров; Auto BLC, AWB; Отношение сигнал/шум: 62 дБ; Режим «день-ночь»: Механический ИК-фильтр; Класс защиты: IP66; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Диапазон рабочих температур: -40…+60°С;  Габаритные размеры: 90х60 мм; Вес: 400 г Производитель: RVi",
                "img": "rvi-c321vb-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 3300,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "2": {
                "id": 11,
                "group": "Антивандальные",
                "manufacturer": "RVI",
                "name": "RVi-123ME (3.6 мм)",
                "description": "Антивандальная камера; 1/3\" ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E; Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности: 0 лк (ИК вкл.); Объектив: 3.6 мм; ИК-подсветка: до 10 метров (12 ИК диодов); Auto ATR, Auto BLC, Auto AGC; Отношение сигнал/шум: 50 дБ; Напряжение питания: DC 9…13 В; Потребление тока: не более       200 мА; Класс защиты: IP66; Диапазон рабочих температур: -40…+60°С; Габаритные размеры: 68х61 мм Производитель: RVi",
                "img": "rvi-123me-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 3300,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "3": {
                "id": 12,
                "group": "Антивандальные",
                "manufacturer": "RVI",
                "name": "RVi-125C (2.8-12 мм) NEW",
                "description": "Антивандальная камера; Матрица: 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ; Нижний порог чувствительности:        0.1 лк @ F1.2 / 0 лк (ИК вкл.); Вариофокальный объектив: 2.8-12 мм; ИК-подсветка: до 30 метров (42 ИК диода); Режим «день-ночь»: Механический ИК фильтр; Auto BLC, ATW, Auto AGC; Отношение сигнал/шум: 62 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 400 мА; Класс защиты: IP66; Диапазон рабочих температур:   -40…+60°С; Габаритные размеры: 134х124х88 мм; Вес: 800 г Производитель: RVi",
                "img": "rvi-125c-2.8-12-mm-new.jpg",
                "type": 2,
                "units": "шт",
                "price": 3600,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "4": {
                "id": 13,
                "group": "Антивандальные",
                "manufacturer": "RVI",
                "name": "RVi-129 (2.8-12 мм)",
                "description": "Антивандальная камера; 1/3\" ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E; Разрешение по горизонтали: 700 ТВЛ; Нижний порог чувствительности: 0.1 лк @ F1.4 / 0 лк (ИК вкл.); Вариофокальный объектив: 2.8-12 мм; ИК-подсветка: до 15 метров (21 ИК диодов); Режим «день-ночь»: Механический ИК фильтр; Auto BLC, AWB; Управление: OSD-меню; Отношение сигнал/шум: 52 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 310 мА; Класс защиты: IP66; Диапазон рабочих температур: -40…+50°С; Габаритные размеры: 140х100 мм; Вес: 730 г Производитель: RVi",
                "img": "rvi-129-2.8-12-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 6050,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "Антивандальные"
        },
        "2": {
            "0": {
                "id": 14,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C421 (5 - 50 мм)",
                "description": "Уличная камера; 1/3” КМОП 1.3MP Sony IMX138; Разрешение по горизонтали: 800 ТВЛ;   Нижний порог чувствительности: 0.01 лк @ F1.2 / 0 лк (ИК вкл.); Объектив; 5-50 мм c АРД; ИК-подсветка: до 60 метров; Режим «день-ночь»: Механический ИК-фильтр; Отношение сигнал/шум: > 50 дБ (АРУ выкл.); Напряжение питания: DC 12 В; Потребление тока: Не более 600 мА (ИК вкл.); Класс защиты: IP66;  Диапазон рабочих температур: -40…+60°С; Габаритные размеры: 310x100x70 мм; Вес: 1 кг Производитель: RVi",
                "img": "rvi-c421-5---50-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 11880,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 15,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C411 (2.8 мм)",
                "description": "Уличная камера; 1/3\" КМОП-матрица 960H Pixel Plus PC1099; Количество \nпикселей по горизонтали и вертикали: 976х496; Разрешение по горизонтали: \n720 ТВЛ; Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); \nОбъектив; 2.8 мм; ИК-подсветка:     до 20 метров; Режим «день-ночь»: \nМеханический ИК-фильтр; Отношение сигнал/шум: 62 дБ; Напряжение \nпитания: DC 12 В; Потребление тока: не более 350 мА; Класс защиты: IP66;  \nДиапазон рабочих температур: -40…+60°С; Габаритные размеры: ?65?155 \nмм; Вес: 380 г",
                "img": "rvi-c411 (2.8 mm).jpg",
                "type": 2,
                "units": "шт",
                "price": 2530,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "def": "1o,2o,3o,4o,5o,6o,7o,8o",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "2": {
                "id": 16,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C411 (3.6 мм)",
                "description": "Уличная камера; 1/3\" КМОП-матрица 960H Pixel Plus PC1099; Количество пикселей по горизонтали и вертикали: 976х496; Разрешение по горизонтали: 720 ТВЛ; Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); Объектив; 3.6 мм; ИК-подсветка:     до 20 метров; Режим «день-ночь»: Механический ИК-фильтр; Отношение сигнал/шум: 62 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Класс защиты: IP66;  Диапазон рабочих температур: -40…+60°С; Габаритные размеры: 65х155 мм; Вес: 380 г Производитель: RVi",
                "img": "rvi-c411-3.6-mm-rvi-c421-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 2530,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "3": {
                "id": 17,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C411 (2.8-12 мм)",
                "description": "Уличная камера; 1/3\" КМОП-матрица 960H Pixel Plus PC1099; Количество \nпикселей по горизонтали и вертикали: 976х496; Разрешение по горизонтали: \n720 ТВЛ; Нижний порог чувствительности 0.02 лк @ F1.2 (0 лк ИК вкл.); \nОбъектив; 2.8-12 мм; ИК-подсветка:     до 40 метров; Режим «день-ночь»: \nМеханический ИК-фильтр; Отношение сигнал/шум: 62 дБ; Напряжение \nпитания: DC 12 В; Потребление тока: не более 600 мА; Класс защиты: IP66;  \nДиапазон рабочих температур: -40…+60°С; Габаритные размеры: 92x85x270 \nмм; Вес: 1 кг",
                "img": "rvi-c411 (2.8-12 mm).jpg",
                "type": 2,
                "units": "шт",
                "price": 4950,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "4": {
                "id": 18,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C421 (2.8 мм)",
                "description": "Уличная камера; 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество \nпикселей по горизонтали и вертикали: 1280х960; Разрешение по \nгоризонтали: 800 ТВЛ;   Нижний порог чувствительности: 0.01 лк @ F1.2 / 0 \nлк (ИК вкл.); Объектив; 2.8 мм; ИК-подсветка:    до 20 метров; Режим «день-\nночь»: Механический ИК-фильтр; Отношение сигнал/шум: 62 дБ; \nНапряжение питания: DC 12 В; Потребление тока: не более 350 мА; Класс \nзащиты: IP66;  Диапазон рабочих температур: -40…+60°С; Габаритные \nразмеры: ?65?155 мм; Вес: 380 г",
                "img": "rvi-c421 (2.8 mm).jpg",
                "type": 2,
                "units": "шт",
                "price": 3630,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "5": {
                "id": 19,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-C421 (3.6 мм)",
                "description": "Уличная камера; 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ;   Нижний порог чувствительности: 0.01 лк @ F1.2 / 0 лк (ИК вкл.); Объектив; 3.6 мм; ИК-подсветка:    до 20 метров; Режим «день-ночь»: Механический ИК-фильтр; Отношение сигнал/шум: 62 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА; Класс защиты: IP66;  Диапазон рабочих температур: -40…+60°С; Габаритные размеры: 65х155 мм; Вес: 380 г Производитель: RVi",
                "img": "rvi-c411-3.6-mm-rvi-c421-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 3630,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "6": {
                "id": 20,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-165C (2.8-12 мм) NEW",
                "description": "Уличная камера; 1/3\" 1.3MP Aptina AR0130 КМОП-матрица; Количество пикселей по горизонтали и вертикали: 1280х960; Разрешение по горизонтали: 800 ТВЛ; Нижний порог чувствительности: 0.1 лк @ F1.2 / 0 лк (ИК вкл.); Вариофокальный объектив: 2.8-12 мм; Режим «день-ночь»: Механический ИК фильтр; ИК-подсветка: до 30 метров (36 ИК диодов); Auto BLC, ATW, Auto AGC; Отношение сигнал/шум: 62 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 400 мА; Класс защиты: IP66; Диапазон рабочих температур: -40…+60°С; Габаритные размеры: ?105х90х267 мм; Вес: 1.3 кг Производитель: RVi",
                "img": "rvi-165c-2.8-12-mm-new.jpg",
                "type": 2,
                "units": "шт",
                "price": 3600,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "7": {
                "id": 21,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-167 (12 мм)",
                "description": "Уличная камера; 1/3\" ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E; Разрешение по горизонтали: 650 ТВЛ;  Нижний порог чувствительности: 0.02 лк @ F1.2 цвет / 0 лк (ИК вкл.); Объектив: 12 мм; ИК-подсветка: до 50 метров (42 ИК диода); Auto BLC, ATW, AGC;  Отношение сигнал/шум: 52 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА, Класс защиты: IP66;  Диапазон рабочих температур: -40…+55°С; Габаритные размеры:85х135 мм; Вес: 900 г Производитель: RVi",
                "img": "rvi-167-12-mm-rvi-167-16-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 4730,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "8": {
                "id": 22,
                "group": "Уличные (с ИК-подсветкой)",
                "manufacturer": "RVI",
                "name": "RVi-167 (16 мм)",
                "description": "Уличная камера; 1/3\" ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E; Разрешение по горизонтали: 650 ТВЛ;  Нижний порог чувствительности: 0.02 лк @ F1.2 цвет / 0 лк (ИК вкл.); Объектив: 16 мм; ИК-подсветка: до 50 метров (42 ИК диода); Auto BLC, ATW, AGC;  Отношение сигнал/шум: 52 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 350 мА, Класс защиты: IP66;  Диапазон рабочих температур: -40…+55°С; Габаритные размеры:85х135 мм; Вес: 900 г Производитель: RVi",
                "img": "rvi-167-12-mm-rvi-167-16-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 4730,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "Уличные (с ИК-подсветкой)"
        },
        "3": {
            "0": {
                "id": 23,
                "group": "Уличные (без ИК-подсветки)",
                "manufacturer": "RVI",
                "name": "RVi-65Magic (4.3 мм)",
                "description": "Уличная камера; 1/3\"  ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E;  Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности:  0.01 лк @ F1.0; Объектив: 4.3 мм; Auto BLC, ATW, Auto AGC;  Отношение сигнал/шум: 50 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 90 мА; Класс защиты: IP66; Диапазон рабочих температур: -40…+55°С; Габаритные размеры: 70х112 мм; Алюминиевый корпус; Кронштейн в комплекте Производитель: RVi",
                "img": "rvi-65magic-4.3-mm-----rvi-65magic-8-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 4400,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "1": {
                "id": 24,
                "group": "Уличные (без ИК-подсветки)",
                "manufacturer": "RVI",
                "name": "RVi-65Magic (8 мм)",
                "description": "Уличная камера; 1/3\"  ПЗС-матрица SONY EXview HAD II; Процессор: Effio-E;  Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности: 0.01 лк @ F1.0; Объектив: 8 мм; Auto BLC, ATW, Auto AGC;  Отношение сигнал/шум: 50 дБ; Напряжение питания: DC 12 В; Потребление тока: не более 90 мА; Класс защиты: IP66; Диапазон рабочих температур: -40…+55°С; Габаритные размеры:70х112 мм; Алюминиевый корпус; Кронштейн в комплекте Производитель: RVi",
                "img": "rvi-65magic-4.3-mm-----rvi-65magic-8-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 4400,
                "binding": [
                    "117",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "Уличные (без ИК-подсветки)"
        },
        "4": {
            "0": {
                "id": 25,
                "group": "Миницилиндр",
                "manufacturer": "RVI",
                "name": "RVi-192Lg (3.6 мм)",
                "description": "Черно-белая камера миницилиндр; 1/3\" ПЗС-матрица LG; Разрешение по горизонтали: 420 ТВЛ; Нижний порог чувствительности: 0.8 лк @ F1.6; Auto BLC, Auto AGC; Отношение сигнал/шум: 48 дБ; Объектив: 6 мм, Напряжение питания: DC 12B; Габаритные размеры: 23х77 мм Производитель: RVi",
                "img": "rvi-192lg-3.6-mm.jpg",
                "type": 2,
                "units": "шт",
                "price": 1100,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "name": "Миницилиндр"
        },
        "5": {
            "0": {
                "id": 26,
                "group": "В стандартном исполнении (без объектива)",
                "manufacturer": "RVI",
                "name": "RVi-C210",
                "description": "Камера в стандартном исполнении; 1/3\" ПЗС-матрица SONY EXview HAD II, Разрешение по горизонтали: 700 ТВЛ; Количество пикселей по горизонтали и вертикали: 976х582; Нижний порог чувствительности: 0.01лк@F1.2; Крепление под объектив CS (в комплект не входит): поддержка АРД; Отношение сигнал/шум: 52 дБ; Видеовыход: BNC; Питание DC 12 В (2Вт); Потребление тока: не более 200 мА; Диапазон рабочих температур: -10°…+55°C; Габаритные размеры: 136х67х62 мм; Вес: 200 г Производитель: RVi",
                "img": "rvi-c210.jpg",
                "type": 2,
                "units": "шт",
                "price": 4730,
                "binding": [
                    "116",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 5
            },
            "name": "В стандартном исполнении (без объектива)"
        },
        "6": {
            "0": {
                "id": 27,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "RVI",
                "name": "RVi-387 NEW",
                "description": "Скоростная купольная камера; 1/4\" ПЗС-матрица SONY EXview HAD II;       Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности: 0.01 лк @ F1.6 (цвет) / 0.001 лк @ F1.6 (ч.б.); Объектив с 23-х кратным оптическим увеличением: 3.9-89.7 мм; 16-ти кратный цифровой зум; Режим «день/ночь»: Механический ИК-фильтр; Отношение сигнал/шум: 52 дБ; RS485; Скорость поворота: до 400°/с; Угол поворота: горизонт 0°-356° / вертикаль 0°-180°  (автопереворот); Протоколы: DH-SD, Pelco-P, Pelco-D; Тревожные входы/выходы: 2/1; Полная интеграция с видеорегистраторами RVi; Питание: AC 24 В (БП); Потребление тока: 3A(±20%); Класс защиты: IP67; Диапазон рабочих температур: -40…+60°С; Габаритные размеры: ?186x234 мм (без кронштейна); Вес: 2 кг; Кронштейн в комплекте Производитель: RVi",
                "img": "rvi-387-new.jpg",
                "type": 2,
                "units": "шт",
                "price": 30800,
                "binding": [
                    "118",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 6
            },
            "1": {
                "id": 28,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "RVI",
                "name": "RVi-C51Z23i",
                "description": "Скоростная купольная камера; 1/4\" ПЗС-матрица SONY EXview HAD II; Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности: 0.01 лк @ F1.6 (цвет) / 0.001 лк @ F1.6 (ч.б.); Объектив с 23-х кратным оптическим увеличением: 3.5-80.5 мм; 12-ти кратный цифровой зум; Режим «день-ночь»: Механический ИК-фильтр; Отношение сигнал/шум: 52 дБ; RS485; Скорость поворота: до 400°/с; Угол поворота: горизонт 0°-356° / вертикаль 0°-180°  (автопереворот); Протоколы: DH-SD, Pelco-P, Pelco-D; Тревожные входы/выходы: 2/1; Полная интеграция с видеорегистраторами RVi; Питание: DC 12 В (БП в комплекте); Диапазон рабочих температур: -10…+60°С; Габаритные размеры: ?170x155 мм (без кронштейна); Вес: 1.8 кг Производитель: RVi",
                "img": "rvi-c51z23i.jpg",
                "type": 2,
                "units": "шт",
                "price": 27500,
                "binding": [
                    "118",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 6
            },
            "2": {
                "id": 29,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "RVI",
                "name": "RVi-C61Z36",
                "description": "Скоростная купольная камера; 1/4\" ПЗС-матрица SONY EXview HAD II; Разрешение по горизонтали: 650 ТВЛ; Нижний порог чувствительности: 0.01 лк @ F1.6 (цвет) / 0.001 лк @ F1.6 (ч.б.) / 0 лк (ИК вкл.); Объектив с 36-х кратным оптическим увеличением: 3.4-122.4мм; 16-ти кратный цифровой зум; ИК-подсветка: до 100 метров (с маскировкой);   Режим «день-ночь»: Механический ИК-фильтр; Отношение сигнал/шум: 50 дБ; Скорость масштабирования (1х Zoom – max Zoom): 4 сек; Скорость поворота: до 400°/с; Угол поворота: горизонт 0°-356° / вертикаль 0°-180°  (автопереворот); Скорость поворота в ручном режиме;     0.1°-120°/с;  Функционал камеры: 55 предустановок, 5 автосканирований, 8 обходов, 5 шаблонов, 3D позиционирование; Настраиваемые параметры изображения: DNR (2D/3D), АРД, Автофокус, AWB, AGC, BLC, HLC, DWDR; Протоколы: DH-SD, Pelco-P/D (Авто определение; Полная интеграция с видеорегистраторами RVi; Питание: AC 24 В; Диапазон рабочих температур: -40…+60°С; Габаритные размеры: ?186х309 мм; Вес: 3,5 кг Производитель: RVi",
                "img": "rvi-c61z36.jpg",
                "type": 2,
                "units": "шт",
                "price": 44000,
                "binding": [
                    "118",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 6
            },
            "name": "Скоростные купольные (уличное исполнение)"
        },
        "name": "Аналоговые камеры видеонаблюдения",
        "id": 1,
        "type": 2
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T207 (2.8-12 mm)",
                "description": "2Мп внутренняя купольная HD-TVI камера с ИК-подсветкой до 30м\n1/2.7\" CMOS матрица; вариообъектив 2.8-12мм; угол обзора 102.4° - 32°; механический ИК-фильтр; 0.01 Лк@F1.2; BLC; DNR; Smart ИК; видеовыход: 1 х HD-TVI; -20°С до +45°С ; 12В DC±15%, 3Вт макс.",
                "img": "cmip7042-28.jpg",
                "type": 4,
                "units": "",
                "price": 4940,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T200",
                "description": "HD TV камера, цветная уличная со встроенной ИК подсветкой (механический ИК-фильтр), ДЕНЬ/НОЧЬ; 1/2.7\" CMOS, 2 МП (1920х1080); 0.01лк/0лк с вкл ИК;  S/N: более 52dB; Дальность ИК подсветки до 20 м; Видеовыход: HD-TVI ; DC12В/330мА; –40°...+60°C; IP66",
                "img": "ds-t200.jpg",
                "type": 4,
                "units": "",
                "price": 2465,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T251",
                "description": "HD-TVI камера, цветная купольная  со встроенной ИК подсветкой (механический ИК-фильтр) и микрофоном, ДЕНЬ/НОЧЬ; 1/3\" CMOS, 2 МП (1920х1080); 0.005лк/0лк с вкл ИК; S/N: более 62dB; Дальность ИК-подсветки до 20 м (Smart IR); OSD, WDR> 120дБ ; DC12В/420мА; –20°...+60°C;  97 х 99.5 х 46.6мм; Аудио выход RCA",
                "img": "ds-t251.jpg",
                "type": 4,
                "units": "шт",
                "price": 3860,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T201",
                "description": "2Мп  купольная HD-TVI камера с ИК-подсветкой до 20м. 1/2.7\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора 103°(2.8мм), 82.2°(3.6мм), 54°(6мм); механический ИК-фильтр; 0.1 Лк@F1.2; Видеовыход: 1 х HD-TVI; -20°С...+45°С; 12В DC±15%, 4Вт макс.",
                "img": "cmip7042-28.jpg",
                "type": 4,
                "units": "шт",
                "price": 2410,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T101",
                "description": "1Мп внутренняя купольная HD-TVI камера с ИК-подсветкой до 20м\n1/4\" CMOS матрица;  механический ИК-фильтр; 0.1 Лк@F1.2; Smart ИК; видеовыход: переключаемый HD-TVI/CVBS; -20°С до +45°С; 12В DC±15%, 4Вт макс.",
                "img": "cmip7042-28.jpg",
                "type": 4,
                "units": "шт",
                "price": 1420,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T204",
                "description": "2Мп внутренняя HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; механический ИК-фильтр; 0.01 Лк@F1.2; встроенный микрофон; PIR-датчик*, 3D DNR; WDR, BLC, Smart ИК; видеовыход: 1 х HD-TVI; -20°С до +45°С; 12В DC±30%, 5Вт макс.2Мп внутренняя HD-TVI камера с ИК-подсветкой до 20м",
                "img": "ds-t204.jpg",
                "type": 4,
                "units": "",
                "price": 3476,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Купольная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T206 (2.8-12 mm)",
                "description": "2Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 40м\n1/2.7\" CMOS матрица; вариообъектив 2.8-12мм; угол обзора 102.4° - 32°; механический ИК-фильтр; 0.01 Лк@F1.2; BLC; DNR; Smart ИК; видеовыход: 1 х HD-TVI; IP66; -40°С до +60°С; 12В DC±15%, 5Вт макс.2Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 40м",
                "img": "ds-t206.jpg",
                "type": 4,
                "units": "",
                "price": 5140,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Купольная камера"
        },
        "1": {
            "0": {
                "id": 8,
                "group": "Антивандальная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T303",
                "description": "3Мп уличная купольная HD-TVI камера с ИК-подсветкой до 20м\n1/3\" CMOS матрица; 1920x1536@18к/с, 1920x1080@25к/с; механический ИК-фильтр; 0.01 Лк@F1.2; DNR; EXIR Smart ИК; OSD-меню; видеовыход: 1 х HD-TVI; IP66; -40°С до +60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t303.jpg",
                "type": 4,
                "units": "",
                "price": 3290,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "def": "3i,7i,8i",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 9,
                "group": "Антивандальная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T503",
                "description": "5Мп уличная HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица;  2592x1944@20к/с, 2560x1440@25к/с; механический ИК-фильтр; 0.01 Лк@F1.2; DNR; EXIR Smart ИК; OSD-меню; видеовыход: 1 х HD-TVI; IP67; -40°С до +60°С; 12В DC±15%, 5Вт макс",
                "img": "ds-t503.jpg",
                "type": 4,
                "units": "",
                "price": 4390,
                "binding": [
                    "122",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "Антивандальная камера"
        },
        "2": {
            "0": {
                "id": 10,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T300",
                "description": "Видеокамера HD TVI цветная уличная со встроенной ИК подсветкой (механический ИК-фильтр), ДЕНЬ/НОЧЬ; 1/3\" CMOS, 3 МП 1920x1536-18к/с, 2 МП 1920x1080-25к/с; 0.01лк/0лк с вкл ИК; f= 6мм ; S/N: более 52dB; EXIR Smart ИК; OSD-меню; Дальность ИК подсветки до 20 м; Видеовыход: HD-TVI ; DC12В/450мА; –40°...+60°C; IP66",
                "img": "ds-t300.jpg",
                "type": 4,
                "units": "",
                "price": 3290,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "def": "1o,2o,3o,4o,5o,6o,7o,8o",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 11,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T500",
                "description": "5Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; 2592x1944@20к/с, 2560x1440@25к/с; механический ИК-фильтр; 0.01 Лк@F1.2; DNR; EXIR Smart ИК; OSD-меню; видеовыход: 1 х HD-TVI; IP67; -40°С до +60°С; 12В DC±15%, 5Вт макс.",
                "img": "ds-t500.jpg",
                "type": 4,
                "units": "",
                "price": 4390,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "2": {
                "id": 12,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T506 (C) (2.7-13.5 mm)",
                "description": "5Мп уличная цилиндрическая HD-TVI камера с EXIR-подсветкой до 40м\n1/2.5\" CMOS матрица; моторизированный вариообъектив 2.7-13.5мм; угол обзора 95.7°-29.1°; 2592x1944@20к/с, 2560x1440@25к/с; механический ИК-фильтр; 0.01 Лк@F1.2; DNR; DWDR, EXIR Smart ИК; OSD-меню; видеовыход: 1 х HD-TVI; IP67; -40°С до +60°С; 12В DC±15%, 6Вт макс.",
                "img": "ds-t506_(2.8-12_mm).jpg",
                "type": 4,
                "units": "",
                "price": 8130,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "3": {
                "id": 13,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T100",
                "description": "1Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 20м                                       1/4\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора: 70.9°(3.6мм), 92°(2.8мм), 56.7°(6мм);  механический ИК-фильтр; 0.1 Лк@F1.2; DNR; Видеовыход: HD-TVI или CVBS; IP66; -40°С...+60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t100.jpg",
                "type": 4,
                "units": "шт",
                "price": 1660,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "4": {
                "id": 14,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T103",
                "description": "1Мп уличная купольная HD-TVI камера с ИК-подсветкой до 15м 1/4\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора: 70.9°(3.6мм), 92°(2.8мм), 56.7°(6мм); механический ИК-фильтр; 0.1 Лк@F1.2; DNR; Видеовыход: HD-TVI или CVBS; IP66; -40°С...+60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t103.jpg",
                "type": 4,
                "units": "шт",
                "price": 1727,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "5": {
                "id": 15,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T116",
                "description": "1.3Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 40м 1/3\" CMOS матрица; вариообъектив 2.8-12мм @ F1.4; угол обзора: 97° - 30.4°; механический ИК-фильтр; 0.1 Лк@F1.2; DNR; Видеовыход: HD-TVI или CVBS; IP66; -40°С…+60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t116.jpg",
                "type": 4,
                "units": "шт",
                "price": 4390,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "6": {
                "id": 16,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T119",
                "description": "1.3Мп уличная купольная HD-TVI камера с ИК-подсветкой до 40м 1/3\" CMOS матрица; вариообъектив 2.8-12мм @ F1.4; угол обзора: 29.3° - 92°; механический ИК-фильтр; 0.01 Лк@F1.2; DNR; Видеовыход: HD-TVI или CVBS; IP66; -40°С…+60°С; 12В DC±15%, 5Вт макс.",
                "img": "ds-t119.jpg",
                "type": 4,
                "units": "шт",
                "price": 4390,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "7": {
                "id": 17,
                "group": "Уличная камера",
                "manufacturer": "LV",
                "name": "LV-HB732F3T",
                "description": "2Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 20м                                       1/2.7\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора:103°(2.8мм), 82.2°(3.6мм), 54°(6мм);  механический ИК-фильтр; 0.01 Лк@F1.2; Видеовыход: 1 х HD-TVI; IP66; -40°С...+60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t200.jpg",
                "type": 4,
                "units": "шт",
                "price": 2740,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "8": {
                "id": 18,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T203",
                "description": "2Мп антивандальная купольная HD-TVI камера с ИК-подсветкой до 20м 1/2.7\" CMOS матрица; объектив 3.6мм (2.8мм, 6мм опционально); угол обзора: 103°(2.8мм), 82.2°(3.6мм), 54°(6мм); механический ИК-фильтр; 0.01 Лк@F1.2; DNR; Видеовыход: 1 х HD-TVI; IP66; -40°С...+60°С; 12В DC±15%, 4Вт макс.",
                "img": "ds-t103.jpg",
                "type": 4,
                "units": "шт",
                "price": 2465,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "9": {
                "id": 19,
                "group": "Уличная камера",
                "manufacturer": "HiWatch",
                "name": "DS-T206 (2.8-12 mm)",
                "description": "2Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 40м 1/2.7\" CMOS матрица; вариообъектив 2.8-12мм @ F1.4; угол обзора: 114.5° - 35.1°; механический ИК-фильтр; 0.1 Лк@F1.2; DNR; OSD-меню; BLC; Видеовыход: 1 х HD-TVI; IP66; -40°С…+60°С; 12В DC±15%, 5Вт макс.",
                "img": "ds-t226.jpg",
                "type": 4,
                "units": "шт",
                "price": 5710,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "Уличная камера"
        },
        "3": {
            "0": {
                "id": 20,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "HiWatch",
                "name": "DS-T245",
                "description": "2Мп внутренняя скоростная поворотная HD-TVI камера\n1/3’’ Progressive Scan CMOS; объектив 4 - 92мм, 23x; угол обзора объектива 49° - 2.2°; механический ИК-фильтр; 0.05лк@F1.6; 1920х1080@25к/с; DWDR, 3D DNR; BLC; вращение 360°, вручную: 0.1° - 160°/с, по предустановке: 160°/с; наклон 0° - 90°, вручную: 0.1° - 120°/с, по предустановке: 120°/с; 1 HD-TVI выход; 1 CVBS выход; тревожные вход/выход 2/1; -20 °C...+45 °C; 24В AC; 12Вт макс",
                "img": "ds-t245.jpg",
                "type": 4,
                "units": "шт",
                "price": 29690,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "1": {
                "id": 21,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "HiWatch",
                "name": "DS-T255",
                "description": "2Мп уличная скоростная поворотная HD-TVI камера\n1/3’’ Progressive Scan CMOS; объектив 4 - 92мм, 23x; угол обзора объектива 49° - 2.2°; механический ИК-фильтр; 0.05лк@F1.6; 1920х1080@25к/с; DWDR, 3D DNR; BLC; вращение 360°, вручную: 0.1° - 160°/с, по предустановке: 160°/с; наклон 0° - 90°, вручную: 0.1° - 120°/с, по предустановке: 120°/с; 1 HD-TVI выход; 1 CVBS выход; тревожные вход/выход 2/1; -35 °C...+65 °C; IP66; грозозащита TVS 4000B; 24В AC; 18Вт макс.",
                "img": "ds-t255.jpg",
                "type": 4,
                "units": "шт",
                "price": 30790,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "2": {
                "id": 22,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "HiWatch",
                "name": "DS-T215",
                "description": "2Мп уличная скоростная поворотная HD-TVI камера с ИК-подсветкой до 100м\n1/2.8’’ Progressive Scan CMOS; объектив 5 - 75мм, 15x; угол обзора объектива 53,8° - 3.5°; механический ИК-фильтр; 0.05лк@F1.4; 1920х1080@25к/с; DWDR, 3D DNR; BLC; вращение 360°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; наклон -15° - 90°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; 1 HD-TVI выход; 1 CVBS выход; -35 °C...+65 °C; IP66; грозозащита TVS 4000B; 12В DC; 20Вт макс.",
                "img": "ds-t215.jpg",
                "type": 4,
                "units": "шт",
                "price": 25290,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "3": {
                "id": 23,
                "group": "Скоростные купольные (уличное исполнение)",
                "manufacturer": "HiWatch",
                "name": "DS-T265",
                "description": "2Мп уличная скоростная поворотная HD-TVI камера с ИК-подсветкой до 100м\n1/2.8’’ Progressive Scan CMOS; объектив 4 - 92мм, 23x; угол обзора объектива 49° - 2.2°; механический ИК-фильтр; 0.05лк@F1.4; 1920х1080@25к/с; DWDR, 3D DNR; BLC; вращение 360°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; наклон -15° - 90°, вручную: 0.1° - 80°/с, по предустановке: 80°/с; 1 HD-TVI выход; 1 CVBS выход; -35 °C...+65 °C; IP66; грозозащита TVS 4000B; 24В AC; 20Вт макс.",
                "img": "ds-t265.jpg",
                "type": 4,
                "units": "шт",
                "price": 33540,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "Скоростные купольные (уличное исполнение)"
        },
        "4": {
            "0": {
                "id": 24,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T101",
                "description": "1Мп внутренняя купольная HD-TVI камера с ИК-подсветкой до 20м\n1/4\" CMOS матрица; объектив 2.8мм; угол обзора 92°; механический ИК-фильтр;  Smart ИК; видеовыход: переключаемый HD-TVI/CVBS; -20°С до +45°С; 12В DC±15%",
                "img": "DS-T101.png",
                "type": 4,
                "units": "шт",
                "price": 1420,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "1": {
                "id": 25,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T201",
                "description": "2Мп внутренняя купольная HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.8мм; угол обзора 103°; механический ИК-фильтр; Smart ИК;  -20°С до +45°С; 12В DC±15%",
                "img": "DS-T201.png",
                "type": 4,
                "units": "шт",
                "price": 2410,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "2": {
                "id": 26,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T591",
                "description": "5Мп внутренняя купольная HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.8мм; угол обзора 85.5°; механический ИК-фильтр;  Smart ИК; OSD-меню; 1 х HD-TVI/AHD/CVI/CVBS; -20°С до +45°С; 12В DC±25%, 5Вт макс.",
                "img": "DS-T591.png",
                "type": 4,
                "units": "шт",
                "price": 3620,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "3": {
                "id": 27,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T100",
                "description": "1Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 20м\n1/4\" CMOS матрица; объектив 2.8мм; угол обзора 92°;  механический ИК-фильтр;IP66; -40°С до +60°С; 12В DC±15%, 4Вт макс.",
                "img": "DS-T100.png",
                "type": 4,
                "units": "шт",
                "price": 1860,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "4": {
                "id": 28,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T200",
                "description": "2Мп уличная цилиндрическая HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.8мм; угол обзора 103°; механический ИК-фильтр;  Smart ИК; видеовыход: 1 х HD-TVI; IP66; -40°С до +60°С; 12В DC±15%",
                "img": "DS-T200.png",
                "type": 4,
                "units": "шт",
                "price": 2740,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "5": {
                "id": 29,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T500",
                "description": "5Мп уличная цилиндрическая HD-TVI камера с EXIR-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.4мм; угол обзора 110°; механический ИК-фильтр;  EXIR Smart ИК; видеовыход: 1 х HD-TVI/AHD/CVI/CVBS; IP67; -40°С до +60°С; 12В DC±25%",
                "img": "DS-T500.png",
                "type": 4,
                "units": "шт",
                "price": 4390,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "6": {
                "id": 30,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T103",
                "description": "1Мп уличная купольная HD-TVI камера с ИК-подсветкой до 20м\n1/4\" CMOS матрица; объектив 2.8мм; угол обзора 92°; механический ИК-фильтрSmart ИК; видеовыход: переключаемый HD-TVI/CVBS; IP66; -40°С до +60°С; 12В DC±15%",
                "img": "DS-T103.png",
                "type": 4,
                "units": "шт",
                "price": 1925,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "7": {
                "id": 31,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T203",
                "description": "2Мп уличная купольная HD-TVI камера с ИК-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.8мм; угол обзора 103°; механический ИК-фильтр; Smart ИК; видеовыход: 1 х HD-TVI; IP66; -40°С до +60°С; 12В DC±15%,",
                "img": "DS-T203.png",
                "type": 4,
                "units": "шт",
                "price": 3070,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "8": {
                "id": 32,
                "group": "Проводная камера",
                "manufacturer": "",
                "name": "DS-T503",
                "description": "5Мп уличная HD-TVI камера с EXIR-подсветкой до 20м\n1/2.7\" CMOS матрица; объектив 2.8мм; угол обзора 86.5°; механический ИК-фильтр; 0.01 Лк@F1.2;EXIR Smart ИК; видеовыход: 1 х HD-TVI; IP67; -40°С до +60°С; 12В DC±15%",
                "img": "DS-T503.png",
                "type": 4,
                "units": "шт",
                "price": 4390,
                "binding": [
                    "123",
                    "105",
                    "109"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "name": "Проводная камера"
        },
        "name": "HDTVI и HDCVI",
        "id": 2,
        "type": 4
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "До 4-х видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N204(B)",
                "description": "4-х канальный IP-регистратор\nВидеовход: 4 IP@4Мп; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Видеосжатие H.265+/H.265/H.264+/H.264; Входящий поток 40 Мб/с; Исходящий поток 60Мб/с. Разрешение записи: до 4Мп. Синхр.воспр. 2 канала@2Мп; 1 канал@4Мп; 1 SATA для HDD до 6Тб, 1 10M/100M Ethernet интерфейс; 2 х USB2.0; -10°C до +55°C;  12В DC; 18Вт макс (без HDD).",
                "img": "ds-n204.jpg",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 5490,
                "fav": "*",
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "До 4-х видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N304P",
                "description": "4-х канальный IP-регистратор c 4-мя PoE интерфейсами\nВидеовход: 4 IP@6Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA;  Видеосжатие H.264+/H.264; Входящий поток 40 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 6Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 2 канала@4Мп, 4 канала@1080P; 1 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; 4 независимых PoE интерфейса 10M/100M; тревожные вход/выход 4/1; 2 х USB; -10°C до +55°C;  48В DC; 60Вт макс (без HDD).",
                "img": "ds-n304p.jpg",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 10990,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "До 4-х видео потоков",
                "manufacturer": "",
                "name": "DS-N304W",
                "description": "4-х канальный WiFi IP-регистратор   Видеовход: 4 IP@5Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI; Аудиовыход; 1 канал RCA;  Видеосжатие H.265/H.264+/H.264; Входящий поток 50 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 5Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 1 канал@5Мп, 4 канала@1080P; 1 SATA для HDD до 6Тб, 1 10M/100M Ethernet интерфейс; 2 х USB 2.0; -10°C до +55°C;  12В DC; 18Вт макс (без HDD).",
                "img": "ds-n304w.jpg",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 14290,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "До 4-х видео потоков",
                "manufacturer": "",
                "name": "CS-X5C-4",
                "description": "4-ми канальный Wi-Fi NVR\nВыходы HDMI/VGA для просмотра видео; усиленный Wi-Fi сигнал дальностью до 100м; поддержка до 4-х FullHD (1080р) камер; поддержка HDD 3.5\" до 6Тб; поддержка протокола ONVIF; 1xSATA; 1xUSB; 1xVGA; 1xHDMI; скорость по Wi-Fi 30 Мбитс, по Ethernet 50 Мбитс; Wi-Fi 2,4 ГГц; 900г",
                "img": "cs-x5c-4.jpg",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 6990,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "До 4-х видео потоков"
        },
        "1": {
            "0": {
                "id": 5,
                "group": "До 8-ми видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N308/2 (В)",
                "description": "8-ми канальный IP-регистратор                                                                                                             Видеовход: 8 IP до 6Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA;  Видеосжатие H.264+/H.264; Входящий поток 80 Мбит/с; Исходящий поток 80 Мбит/с. Разрешение записи: до 6Мп. Синхр.воспр. 6 каналов 1080P; 2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; тревожные вход/выход 4/1; 1 х USB 3.0; 1 х USB 2.0, -10°C до +55°C;  12В DC; 10Вт макс (без HDD).",
                "img": "ds_n3082.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 11540,
                "fav": "*",
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 6,
                "group": "До 8-ми видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N308/2P",
                "description": "8-ми канальный IP-регистратор c 8-ю PoE интерфейсами\nВидеовход: 8 IP@6Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA;  Видеосжатие H.264+/H.264; Входящий поток 80 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 6Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 6 каналов@1080P; 2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; 8 независимых PoE интерфейсов 10M/100M; тревожные вход/выход 4/1; 2 х USB; -10°C до +55°C;  100-240В АC; 130Вт макс (без HDD).",
                "img": "ds_n3082.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 15940,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "2": {
                "id": 7,
                "group": "До 8-ми видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N308/2P(B)",
                "description": "8-ми канальный IP-регистратор c 8-ю PoE интерфейсами\nВидеовход: 8 IP@8Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 4К; Аудиовыход; 1 канал RCA;  Видеосжатие H.265+/H.265/H.264+/H.264; Входящий поток 80 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 8Мп / 6Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 1 канал@8Мп, 4 канала@1080P;  2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; 8 независимых PoE интерфейса 10M/100M; 2 х USB 2.0; -10°C до +55°C;  220В АC; 95Вт макс (без HDD).",
                "img": "ds_n3082.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 17260,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "3": {
                "id": 8,
                "group": "До 8-ми видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N208(B)",
                "description": "8-ми канальный IP-регистратор\nВидеовход: 8 IP@4Мп; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Видеосжатие H.265+/H.265/H.264+/H.264; Входящий поток 60 Мб/с; Исходящий поток 60Мб/с. Разрешение записи: до 4Мп. Синхр.воспр. 2 канала@2Мп; 1 канал@4Мп; 1 SATA для HDD до 6Тб, 1 10M/100M Ethernet интерфейс; 2 х USB2.0; -10°C до +55°C;  12В DC; 18Вт макс (без HDD).",
                "img": "ds-n108p.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 6920,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "4": {
                "id": 9,
                "group": "До 8-ми видео потоков",
                "manufacturer": "",
                "name": "DS-N308W",
                "description": "8-ми канальный WiFi IP-регистратор                                                                                                       Видеовход: 8 IP@5Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI; Аудиовыход; 1 канал RCA;  Видеосжатие H.265/H.264+/H.264; Входящий поток 50 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 5Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 1 канал@5Мп, 4 канала@1080P; 1 SATA для HDD до 6Тб, 1 10M/100M Ethernet интерфейс; 2 х USB 2.0; -10°C до +55°C;  12В DC; 18Вт макс (без HDD).",
                "img": "ds-n308w.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 15390,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "5": {
                "id": 10,
                "group": "До 8-ми видео потоков",
                "manufacturer": "",
                "name": "CS-X5C-8",
                "description": "8-ми канальный Wi-Fi NVR\nВыходы HDMI/VGA для просмотра видео; усиленный Wi-Fi сигнал дальностью до 100м; поддержка до 8-ми FullHD (1080p) камер; поддержка HDD 3.5\" до 6Тб; поддержка протокола ONVIF; 1xSATA; 1xUSB; 1xVGA; 1xHDMI; скорость по Wi-Fi 30 Мбитс, по Ethernet 50 Мбитс; Wi-Fi 2,4 ГГц; 900 г",
                "img": "cs-x5c-8.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 7990,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "6": {
                "id": 11,
                "group": "До 8-ми видео потоков",
                "manufacturer": "",
                "name": "CS-X3C-8E",
                "description": "8-ми канальный Wi-Fi NVR\nВыходы HDMI/VGA для просмотра видео; усиленный Wi-Fi сигнал дальностью до 100м; поддержка до 8-ми FullHD (1080p) камер; поддержка HDD 3.5\" до 6Тб; поддержка протокола ONVIF; 1xSATA; 1xUSB; 1xVGA; 1xHDMI; скорость по Wi-Fi 30 Мбитс, по Ethernet 50 Мбитс; Wi-Fi 2,4 ГГц; 900 г",
                "img": "cs-x3c-8e.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 11990,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "До 8-ми видео потоков"
        },
        "2": {
            "0": {
                "id": 12,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N316/2(B)",
                "description": "16-ти канальный IP-регистратор                                                                                                              Видеовход: 16 IP@8Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 4К; Аудиовыход; 1 канал RCA;  Видеосжатие H.265+/H.265/H.264+/H.264; Входящий поток 160 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 8Мп / 6Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 1 канал@8Мп, 4 канала@1080P; 2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; 2 х USB 2.0; -10°C до +55°C;  12В DC; 15Вт макс (без HDD).",
                "img": "ds_n3162.jpg",
                "type": 1,
                "streams": 16,
                "units": "шт",
                "price": 13190,
                "fav": "*",
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 13,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N316/2P",
                "description": "16-ти канальный IP-регистратор c 8-ю PoE интерфейсами\nВидеовход: 16 IP@6Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA;  Видеосжатие H.264+/H.264; Входящий поток 160 Мб/с; Исходящий поток 80 Мб/с. Разрешение записи: 6Мп / 4Мп / 3Мп / 1080p / 1.3Mp / UXGA / 720p / VGA / 4CIF / DCIF / 2CIF /CIF / QCIF. Синхр.воспр. 6 каналов@1080P; 2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; 8 независимых PoE интерфейсов 10M/100M; тревожные вход/выход 4/1; 2 х USB; -10°C до +55°C;  100-240В АC; 15Вт макс (без HDD)",
                "img": "ds_n3162.jpg",
                "type": 1,
                "streams": 16,
                "units": "шт",
                "price": 19790,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "До 16-ти видео потоков"
        },
        "3": {
            "0": {
                "id": 14,
                "group": "До 32-х видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-N332/2",
                "description": "32-х канальный IP-регистратор                                                                                                             Видеовход: 32 IP до 6Мп; Аудиовход: 1 канал RCA;  Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA;  Видеосжатие H.264+/H.264; Входящий поток 160 Мбит/с; Исходящий поток 80 Мбит/с. Разрешение записи: до 6Мп. Синхр.воспр. 6 каналов 1080P; 2 SATA для HDD до 6Тб, 1 10M/100M/1000M Ethernet интерфейс; тревожные вход/выход 4/1; 1 х USB 3.0; 1 х USB 2.0, -10°C до +55°C;  12В DC; 10Вт макс (без HDD).",
                "img": "ds_n3162.jpg",
                "type": 1,
                "streams": 32,
                "units": "шт",
                "price": 22540,
                "binding": [
                    "104"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "До 32-х видео потоков"
        },
        "name": "IP-видеорегистраторы",
        "id": 3,
        "type": 1
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "4-х канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R04LA WHITE",
                "description": "4-канальный; Меню рус. Формат сжатия: Н.264; OS Linux;   Видеовходы: 4 BNC; Видеовыходы:1 BNC +  1 VGA + HDMI;  Разрешение VGA/HDMI: 1280х1024, 1920х1080; Аудио вх./вых.: 1/1; Разрешение и скорость записи: 960х576 (960Н) @ 100 к/с; Гибридный режим (3 аналоговых камеры 960H @ 25 к/с на канал / 1 IP-камера FULLHD @ 25 к/с, либо 2 аналоговые камеры 960H @ 25 к/с на канал / 2 IP-камеры FULLHD @ 25 к/с на канал);  Воспроизведение: 1-4 канала видео; 1 HDD SATA  до 4 ТБ; LAN, Dual stream (функция двойного кодирования видеопотока), мониторинг через мобильный телефон; USB 2.0; мышь;  Питание: DC 12 В (блок питания в комплекте);  Габаритные размеры: 205x205x45 мм; Вес: 0.8 кг; В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-SmartPSS Производитель: RVi",
                "img": "rvi-r04la-white.jpg",
                "type": 2,
                "streams": 4,
                "units": "шт",
                "price": 6600,
                "fav": "*",
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "4-х канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R04LB-PRO",
                "description": "4-канальный; Меню рус. Формат сжатия: Н.264; OS Linux;  4 входа BNC; Видеовыходы: 1 BNC + 1 VGA + 1 HDMI (1920x1080); Разрешение VGA/HDMI: 1280х1024, 1920х1080; Аудио вх./вых.: 4/1;  Тревожные вх./вых.: 4/3; Разрешение и скорость записи: 960х576 (960H) @ 100 к/с; Гибридный режим (3 аналоговых камеры 960H @ 75 к/с + 1 IP-камера 720P @ 25 к/с); Отображение: 960х576 @ 100к/с; Воспроизведение: 1-4 каналов видео; 1 HDD SATA  до 4 ТБ; LAN, RS-485; USB 2.0; Пульт д/у, мышь; Питание: DC 12 В (блок питания в комплекте); Габаритные размеры: 325x242x55 мм;  Вес: 1,5 кг (без HDD); В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-SmartPSS Производитель: RVi",
                "img": "rvi-r04lb-pro.jpg",
                "type": 2,
                "streams": 4,
                "units": "шт",
                "price": 7700,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "4-х канальные, Формат сжатия Н.264"
        },
        "1": {
            "0": {
                "id": 3,
                "group": "8-ми канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "LV-T9308YHS",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых/ HD-TVI и AHD камер, + 2 IP-камеры@1080p;  Видеовход: 8 каналов, BNC; Аудиовход.: 1 канал RCA,  двустороннее аудио: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 2Мп; Аудиовыход; 1 канал RCA; видеосжатие H.264; аудиосжатие G.711u; Разрешение записи на канал для TVI: 1080p@12к/с,  1080p Lite / 720p Lite / 720p@25к/с; для AHD: 720p@25к/с; для аналоговых камер WD1@25к/с; для IP: Дополнительно 2 канала 1080p@25к/с; Синхронное воспроизведение 4 канала@1080p; 1 SATA для HDD до 6Тб каждый; 1 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C...+55°C; питание 12В DC; 12Вт макс.",
                "img": "lv_t9308yhs.jpg",
                "type": 2,
                "streams": 8,
                "units": "шт",
                "price": 10990,
                "fav": "*",
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 4,
                "group": "8-ми канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R08LB-PRO",
                "description": "8-канальный; Меню рус; Формат сжатия: Н.264; OS Linux;  Видеовходы:  8 BNC; Видеовыходы:  1 BNC + 1 VGA + 1 HDMI + 1 SPOT (Multi-SPOT); Разрешение VGA/HDMI: 800х600, 1024х768, 1280х720, 1280х1024, 1920х1080;  Аудио вх./вых.: 4/1; Аудио вх./вых. для двунаправленных переговоров: 1/1;  Тревожные вх./вых.: 8/3;  Разрешение и скорость записи: 960х576 (960H) @ 200 к/с; Гибридный режим (6 аналоговых камеры 960H @ 150 к/с + 2 IP-камеры 720P @ 50 к/с);  Отображение: 960х576 @ 200к/с; Воспроизведение: 1-4-8 каналов видео; 2 HDD SATA до 4 ТБ каждый; LAN; RS-485; RS-232; USB 2.0; Пульт д/у, мышь; Питание: DC 12 В (блок питания в комплекте); Габаритные размеры: 375x285x45 мм;  Вес: 2.35 кг (без HDD); В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-SmartPSS Производитель: RVi",
                "img": "rvi-r08lb-pro.jpg",
                "type": 2,
                "streams": 8,
                "units": "шт",
                "price": 16500,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "2": {
                "id": 5,
                "group": "8-ми канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R08MA",
                "description": "8-канальный  (8 аналог (BNC) + 4 IP);  Меню рус; Формат сжатия: Н.264; OS Linux;  Видеовходы: 8 BNC; Видеовыходы: 1 BNC + 1 VGA + 1 HDMI (независимый от VGA); Разрешение VGA/HDMI: 800х600, 1024х768, 1280х720, 1280х1024, 1920х1080; Аудио вх./вых.: 8/1;  Тревожные вх./вых.: 8/4; Разрешение и скорость записи (аналог/IP): 960х576 (960H) @ 200 к/с / 1920x1080 (FullHD) @ 100 к/с; Видеорегистратор имеет возможность подключения IP-видеокамер с разрешением до 5 МП по протоколу ONVIF; Суммарный входящий битрейт подключаемых IP-камер: 32 Мбит/c; Отображение: 960х576 @ 200к/с; Воспроизведение: 1-4-8 каналов видео; 2 HDD SATA до 4 ТБ каждый; LAN; RS-485; USB 2.0; Пульт д/у, мышь; Питание: DC 12 В (блок питания в комплекте); Габаритные размеры: 445x290x44 мм; Возможность установки в 19\" стойку (кронштейны в комплекте); В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-IVMS Производитель: RVi",
                "img": "rvi-r08ma.jpg",
                "type": 2,
                "streams": 8,
                "units": "шт",
                "price": 16500,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "8-ми канальные, Формат сжатия Н.264"
        },
        "2": {
            "0": {
                "id": 6,
                "group": "16-ти канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "DS-H216U(B)",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 18 с замещением аналоговых)\nВидеовход: 16 каналов BNC; Аудиовход: 16 каналов RCA (1 канал для двустороннего аудио); Видеовыход: 1 VGA до 2К, 1 HDMI до 4К, 1 CVBS; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI:  5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 4Мп@25к/с. 2 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M/ 1000M Ethernet интерфейс; 1 USB2.0, 1 USB3.0; 1 RS-485; Трев. вход/выход 16/4; -10°C до +55°C; 12В DC: 20Вт макс (без HDD).16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 18 с замещением аналоговых)",
                "img": "",
                "type": 2,
                "streams": 16,
                "units": "шт",
                "price": 32990,
                "fav": "*",
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 7,
                "group": "16-ти канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R16LB-PRO",
                "description": "16-канальный; Меню рус; Формат сжатия: Н.264; OS Linux;  Видеовходы:  16 BNC; Видеовыходы:  1 BNC + 1 VGA + 1 HDMI + 1 SPOT (Multi-SPOT); Разрешение VGA/HDMI: 800х600, 1024х768, 1280х720, 1280х1024, 1920х1080;  Аудио вх./вых.: 4/1; Аудио вх./вых. для двунаправленных переговоров: 1/1;  Тревожные вх./вых.: 8/3;  Разрешение и скорость записи: 960х576 (960H) @ 200 к/с; Гибридный режим (14 аналоговых камеры 960H @ 350 к/с + 2 IP-камеры 1080P @ 50 к/с, либо 12 аналоговых камеры 960H @ 300 к/с + 4 IP-камеры 720P @   100 к/с); Отображение: 960х576 @ 200к/с; Воспроизведение: 1-4-8 каналов видео; 2 HDD SATA до 4 ТБ каждый; LAN; RS-485; RS-232; USB 2.0; Пульт д/у, мышь; Питание: DC 12 В (блок питания в комплекте); Габаритные размеры: 375x285x45 мм; Вес: 2.35 кг (без HDD); В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-SmartPSS Производитель: RVi",
                "img": "rvi-r16lb-pro.jpg",
                "type": 2,
                "streams": 16,
                "units": "шт",
                "price": 19800,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "2": {
                "id": 8,
                "group": "16-ти канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R16MA-PRO",
                "description": "16-ти канальный DVR. Меню рус. Формат сжатия Н.264. OS Linux;    16 входов BNC, 1 выход BNC + 1 VGA +  (1920x1080) + 1 SPOT (Multi-SPOT) + 16 сквозных; Разрешение VGA/HDMI: 800х600, 1024х768, 1280х720, 1280х1024, 1920х1080; 4 входа аудио,        1 выход аудио  + 1/1 вход/выход для двунаправленных переговоров;   Тревожные вх./вых.:      16/3; Разрешение записи: 960х576 (960H) @ 400 к/с,704х576 (D1) @ 400 к/с, Отображение: 704х576 @ 400 к/с; Воспроизведение:   1-4-8-16 каналов видео; 4 HDD SATA  (макс. объем до 3 Тб каждый);  LAN; RS485;RS232; USB 2.0; Интерфейс eSATA (архивация и запись на внешний массив    до 4-х HDD); пульт д/у, мышь; Профессиональное ПО RVi-PSS в комплекте БЕСПЛАТНО;  Питание: 222 В, 50 Гц / 110 В, 60 Гц; Габаритные размеры: 440x460x68 мм,  возможность установки в 19\" стойку (кронштейны в комплекте) Производитель: RVi",
                "img": "rvi-r16ma-pro.jpg",
                "type": 2,
                "streams": 16,
                "units": "шт",
                "price": 36300,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "3": {
                "id": 9,
                "group": "16-ти канальные, Формат сжатия Н.264",
                "manufacturer": "RVI",
                "name": "RVi-R16MA",
                "description": "16-канальный  (16 аналог (BNC) + 8 IP);  Меню рус; Формат сжатия: Н.264; OS Linux;  Видеовходы: 16 BNC; Видеовыходы: 1 BNC + 1 VGA + 1 HDMI (независимый от VGA); Разрешение VGA/HDMI: 800х600, 1024х768, 1280х720, 1280х1024, 1920х1080; Аудио вх./вых.: 16/1;  Тревожные вх./вых.: 16/4;  Разрешение и скорость записи (аналог/IP): 960х576 (960H) @ 400 к/с / 1920x1080 (FullHD) @ 200 к/с; Видеорегистратор имеет возможность подключения IP-видеокамер с разрешением до 5 МП по протоколу ONVIF; Суммарный входящий битрейт подключаемых IP-камер: 32 Мбит/c; Отображение: 960х576 @ 200к/с; Воспроизведение: 1-4-8-16 каналов видео; 2 HDD SATA до 4 ТБ каждый; LAN; RS-485; USB 2.0; Пульт д/у, мышь; Питание: DC 12 В (блок питания в комплекте); Габаритные размеры: 445x290x44 мм; Возможность установки в 19\" стойку (кронштейны в комплекте); В комплекте поставляется бесплатное профессиональное программное обеспечение RVi-IVMS Производитель: RVi",
                "img": "rvi-r16ma.jpg",
                "type": 2,
                "streams": 16,
                "units": "шт",
                "price": 24200,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "16-ти канальные, Формат сжатия Н.264"
        },
        "3": {
            "0": {
                "id": 10,
                "group": "32-х канальные гибридные, фомат сжатия H.264",
                "manufacturer": "RVI",
                "name": "RVi-HR16/16",
                "description": "32-канальный; Меню рус; Формат сжатия: Н.264; OS Linux; Видеовходы:",
                "img": "rvi-hr16-16.jpg",
                "type": 2,
                "streams": 32,
                "units": "шт",
                "price": 77000,
                "binding": [
                    "119"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "32-х канальные гибридные, фомат сжатия H.264"
        },
        "name": "Цифровые видеорегистраторы",
        "id": 4,
        "type": 2
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "До 4-х видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H204Q",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 1 IP-канал (до 6 с замещением аналоговых в Enhanced IP mode)*\nВидеовход: 4 канала BNC; Аудиовход: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход: 1 канал RCA; видеосжатие H.265 Pro/H.265/H.265+/H.264/H.264+; аудиосжатие G.711u., \nРазрешение записи на канал: TVI: 3Мп@15к/с (1й канал)/ 4Мп Lite, 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры: WD1@25к/с; IP: до 6Мп - входящий битрейт 24Мбит/с, 1 SATA для HDD до 6Тб; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0; -10°C до +55°C; 12В DC: 8Вт макс (без HDD).",
                "img": "ds-h104q.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 7140,
                "fav": "*",
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "До 4-х видео потоков"
        },
        "1": {
            "0": {
                "id": 2,
                "group": "До 8-ми видео потоков",
                "manufacturer": "LV",
                "name": "LV-T9308YHS",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых/ HD-TVI и AHD камер, + 2 IP-камеры@1080p;  Видеовход: 8 каналов, BNC; Аудиовход.: 1 канал RCA,  двустороннее аудио: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 2Мп; Аудиовыход; 1 канал RCA; видеосжатие H.264; аудиосжатие G.711u; Разрешение записи на канал для TVI: 1080p@12к/с,  1080p Lite / 720p Lite / 720p@25к/с; для AHD: 720p@25к/с; для аналоговых камер WD1@25к/с; для IP: Дополнительно 2 канала 1080p@25к/с; Синхронное воспроизведение 4 канала@1080p; 1 SATA для HDD до 6Тб каждый; 1 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C...+55°C; питание 12В DC; 12Вт макс.",
                "img": "lv_t9308yhs.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 10990,
                "fav": "*",
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "1": {
                "id": 3,
                "group": "До 8-ми видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H208U",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 10 с замещением аналоговых)\nВидеовход: 8 каналов BNC; Аудиовход: 4 канала RCA (1 канал для двустороннего аудио); Видеовыход: 1 VGA до 2К, 1 HDMI до 4К, 1 CVBS; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI:  5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 6Мп@25к/с. 1 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M/ 1000M Ethernet интерфейс; 1 USB2.0, 1 USB3.0; 1 RS-485; Трев. вход/выход 8/4; -10°C до +55°C; 12В DC: 20Вт макс (без HDD)",
                "img": "ds_h108u.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 17480,
                "fav": "*",
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 1
            },
            "name": "До 8-ми видео потоков"
        },
        "2": {
            "0": {
                "id": 4,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H216Q",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 18 с замещением аналоговых)\nВидеовход: 16 каналов BNC; Аудиовход: 1 канал RCA; Видеовыход: 1 VGA до 2К, 1 HDMI до 4К; Аудиовыход; 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 3Мп@15к/с (первые 4 канала), 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: доп. 2 канала до 4Мп. 1 SATA для HDD до 6Тб; 1 RJ-45 10M/100M /1000M Ethernet интерфейс; 2 USB2.0;  -10°C до +55°C; 12В DC; 15Вт макс (без HDD).16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 18 с замещением аналоговых)",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 17040,
                "fav": "*",
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "1": {
                "id": 5,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H316/2Q",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 24-х с замещением аналоговых в Enhanced IP mode)*\nВидеовход: 16 каналов BNC; Аудиовход: 16 каналов; Видеовыход: 1 VGA до 2К, 1 HDMI до 4К; Аудиовыход; 1 канал RCA; видеосжатие H.265 Pro/H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 3Мп@15к/с (первые 4 канала), 4Мп Lite, 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: до 6Мп - входящий битрейт 72Мбит/с, 2 SATA для HDD до 8Тб; 1 RS-485; Трев. вход/выход 16/4, 1 RJ-45 10M/100M /1000M Ethernet интерфейс; 1 USB2.0; 1 USB3.0, -10°C до +55°C; 12В DC; 25Вт макс (без HDD).",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 22510,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 2
            },
            "name": "До 16-ти видео потоков"
        },
        "3": {
            "0": {
                "id": 6,
                "group": "До 4-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H204QP",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер с PoC, 1 IP-канал (до 5 с замещением аналоговых)\nВидеовход: 4 канала BNC; Аудиовход: 4 канала RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 4Мп Lite, 3Мп@15к/с (1й канал)/ 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 1 канал до 4Мп; 1 SATA для HDD до 8Тб; Трев. вход/выход 4/1, 1 RS-485; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0; -10°C до +55°C; 48В DC: 40Вт макс (без HDD).4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер с PoC, 1 IP-канал (до 5 с замещением аналоговых)",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 10490,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "1": {
                "id": 7,
                "group": "До 4-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H104G",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых/ HD-TVI и AHD камер, + 1 IP-камера@720p; Видеовход: 4 канала, BNC; Аудиовход.: 1 канал RCA,  двустороннее аудио: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 2Мп; Аудиовыход; 1 канал RCA; видеосжатие H.264; аудиосжатие G.711u; Разрешение записи на канал для TVI и AHD: 720p@25к/с; для аналоговых камер: WD1@25к/с; для IP: Дополнительно 1 канал 720p@25к/с; Синхронное воспроизведение 4 канала@720p; 1 SATA для HDD до 6Тб каждый; 1 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C...+55°C; питание 12В DC: 8Вт макс.",
                "img": "ds-h104g.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 4390,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "2": {
                "id": 9,
                "group": "До 4-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H204U(B)",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 6 с замещением аналоговых)\nВидеовход: 4 канала BNC; Аудиовход: 4 канала RCA (1 канал для двустороннего аудио); Видеовыход: 1 VGA и 1 HDMI до 1080Р, 1 CVBS; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI:  5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 6Мп@25к/с. 1 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0; 1 RS-485; Трев. вход/выход 4/1; -10°C до +55°C; 12В DC: 15Вт макс (без HDD",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 11210,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "3": {
                "id": 10,
                "group": "До 4-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H304Q",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 1 IP-канал (до 6 с замещением аналоговых в Enhanced IP mode)*\nВидеовход: 4 канала BNC; Аудиовход: 4 канала; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход: 1 канал RCA; видеосжатие H.265 Pro/H.265/H.265+/H.264/H.264+; аудиосжатие G.711u., обнаружение движения, вторжения в область и пересечения линии;\nРазрешение записи на канал: TVI: 3Мп@15к/с (1й канал)/ 4Мп Lite, 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры: WD1@25к/с; IP: до 6Мп - входящий битрейт 24Мбит/с, 1 SATA для HDD до 10Тб; Трев. вход/выход 4/1, 1 RS-485; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0; -10°C до +55°C; 12В DC: 6Вт макс (без HDD).",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 8415,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "4": {
                "id": 11,
                "group": "До 4-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H204UP",
                "description": "4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер с PoC, 2 IP-канала (до 6 с замещением аналоговых)\nВидеовход: 4 канала BNC; Аудиовход: 4 канала RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: 5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 6Мп@25к/с; 1 SATA для HDD до 8Тб; Трев. вход/выход 4/1, 1 RS-485; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0; -10°C до +55°C; 48В DC: 40Вт макс (без HDD).4-х канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер с PoC, 2 IP-канала (до 6 с замещением аналоговых)",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 4,
                "units": "шт",
                "price": 12860,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 3
            },
            "name": "До 4-ти видео потоков"
        },
        "4": {
            "0": {
                "id": 12,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H208Q",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 10 с замещением аналоговых)\nВидеовход: 8 каналов BNC; Аудиовход: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 3Мп@15к/с (первые 2 канала), 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: доп. 2 канала до 4Мп. 1 SATA для HDD до 6Тб; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C до +55°C; 12В DC; 12Вт макс (без HDD).8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 10 с замещением аналоговых)",
                "img": "ds-h108g.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 10440,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "1": {
                "id": 13,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H108G",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых/ HD-TVI и AHD камер, + 1 IP-камера@1080p; Видеовход: 8 каналов, BNC; Аудиовход.: 1 канал RCA,  двустороннее аудио: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 2Мп; Аудиовыход; 1 канал RCA; видеосжатие H.264; аудиосжатие G.711u; Разрешение записи на канал для TVI и AHD: 720p@25к/с; для аналоговых камер: WD1@25к/с; для IP: Дополнительно 1 канал 1080p@25к/с; Синхронное воспроизведение 8 каналов@720p; 1 SATA для HDD до 6Тб каждый; 1 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C...+55°C; питание 12В DC; 12Вт макс.",
                "img": "ds-h108g.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 7030,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "2": {
                "id": 14,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H208Q",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 10 с замещением аналоговых)\nВидеовход: 8 каналов BNC; Аудиовход: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 3Мп@15к/с (первые 2 канала), 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: доп. 2 канала до 4Мп. 1 SATA для HDD до 6Тб; 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C до +55°C; 12В DC; 12Вт макс (без HDD).",
                "img": "ds-h108q.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 10440,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "3": {
                "id": 15,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H208QP",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер c PoC + 2 IP-канала (до 10 с замещением аналоговых)\nВидеовход: 8 каналов BNC; Аудиовход: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 8 каналов RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 4Мп Lite, 3Мп@15к/с (первые 2 канала), 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: доп. 2 канала до 4Мп. 2 SATA для HDD до 8Тб; 1 RS-485; Трев. вход/выход 8/4, 1 RJ-45 10M/ 100M Ethernet интерфейс; 2 USB2.0;  -10°C до +55°C; 48В DC; 60Вт макс (без HDD).8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер c PoC + 2 IP-канала (до 10 с замещением аналоговых)",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 19130,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "4": {
                "id": 16,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H308Q",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала (до 12 с замещением аналоговых в Enhanced IP mode)*\nВидеовход: 8 каналов BNC; Аудиовход: 8 каналов; Видеовыход: 1 VGA и 1 HDMI до 1080Р; Аудиовыход; 1 канал RCA; видеосжатие H.265 Pro/H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.",
                "img": "ds_h104u.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 13255,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "5": {
                "id": 17,
                "group": "До 8-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H208UP",
                "description": "8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер c PoC + 2 IP-канала (до 10-ти с замещением аналоговых)\nВидеовход: 8 каналов BNC; Аудиовход: 8 каналов RCA; Видеовыход: 1 VGA и 1 HDMI до 4К; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 8Мп@8к/с, 5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 6Мп@25к/с; 2 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M / 1000M Ethernet интерфейс; 1 USB2.0, 1  USB3.0; 1 RS-485; Трев. вход/выход 8/4; -10°C до +55°C; 48В DC: 60Вт макс (без HDD).8-ми канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер c PoC + 2 IP-канала (до 10-ти с замещением аналоговых)",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 8,
                "units": "шт",
                "price": 23970,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 4
            },
            "name": "До 8-ти видео потоков"
        },
        "5": {
            "0": {
                "id": 18,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H216U(B)",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 18 с замещением аналоговых)\nВидеовход: 16 каналов BNC; Аудиовход: 16 каналов RCA (1 канал для двустороннего аудио); Видеовыход: 1 VGA до 2К, 1 HDMI до 4К, 1 CVBS; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI:  5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 4Мп@25к/с. 2 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M/ 1000M Ethernet интерфейс; 1 USB2.0, 1 USB3.0; 1 RS-485; Трев. вход/выход 16/4; -10°C до +55°C; 12В DC: 20Вт макс (без HDD).16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 18 с замещением аналоговых)",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 36510,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 5
            },
            "1": {
                "id": 19,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H116G",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых/ HD-TVI и AHD камер, + 1 IP-камера@1080p; Видеовход: 16 каналов, BNC; Аудиовход.: 1 канал RCA,  двустороннее аудио: 1 канал RCA; Видеовыход: 1 VGA и 1 HDMI до 2Мп; Аудиовыход; 1 канал RCA; видеосжатие H.264; аудиосжатие G.711u; Разрешение записи на канал для TVI и AHD: 720p@25к/с; для аналоговых камер: WD1@25к/с; для IP: Дополнительно 1 канал 1080p@25к/с; Синхронное воспроизведение 16 каналов@720p; 1 SATA для HDD до 6Тб каждый; 1 10M/ 100M Ethernet интерфейс; 2 USB2.0; -10°C...+55°C; питание 12В DC; 20Вт макс.",
                "img": "ds-h116g.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 13190,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 5
            },
            "2": {
                "id": 20,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H216U(B)",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер + 2 IP-канала@4Мп (до 18 с замещением аналоговых)\nВидеовход: 16 каналов BNC; Аудиовход: 16 каналов RCA (1 канал для двустороннего аудио); Видеовыход: 1 VGA до 2К, 1 HDMI до 4К, 1 CVBS; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI:  5Мп@12к/с, 4Мп@15к/с, 3Мп@18к/с, 1080p / 720p@25к/с; AHD и CVI: 1080p/720p@25к/с; аналоговые камеры: WD1@25к/с; IP: доп. 2 канала 4Мп@25к/с. 2 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M/ 1000M Ethernet интерфейс; 1 USB2.0, 1 USB3.0; 1 RS-485; Трев. вход/выход 16/4; -10°C до +55°C; 12В DC: 20Вт макс (без HDD).",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 36510,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 5
            },
            "3": {
                "id": 21,
                "group": "До 16-ти видео потоков",
                "manufacturer": "HiWatch",
                "name": "DS-H216QP",
                "description": "16-ти канальный гибридный HD-TVI регистратор для  аналоговых, HD-TVI, AHD и CVI камер c PoC + 2 IP-канала (до 18-ти с замещением аналоговых)\nВидеовход: 16 каналов BNC; Аудиовход: 4 канала RCA; Видеовыход: 1 VGA и 1 HDMI до 4К; Аудиовыход: 1 канал RCA; видеосжатие H.265/H.265+/H.264/H.264+; аудиосжатие G.711u.\nРазрешение записи на канал: TVI: 4Мп Lite, 3Мп@15к/с (первые 4 канала), 1080p@15к/с, 1080p Lite /720p Lite /720p@25к/с; AHD и CVI: 1080p@15к/с, 1080p Lite /720p@25к/с; аналоговые камеры WD1@25к/с; IP: доп. 2 канала до 4Мп.; 2 SATA для HDD до 8Тб; 1 RJ-45 10M/ 100M / 1000M Ethernet интерфейс; 1 USB2.0, 1  USB3.0; 1 RS-485; Трев. вход/выход 4/1, -10°C до +55°C; 48В DC: 120Вт макс (без HDD)",
                "img": "ds_h116u.jpg",
                "type": 4,
                "streams": 16,
                "units": "шт",
                "price": 31340,
                "binding": [
                    "125"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 5
            },
            "name": "До 16-ти видео потоков"
        },
        "name": "HD-видеорегистраторы",
        "id": 5,
        "type": 4
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Сетевые коммутаторы",
                "manufacturer": "TP-Link",
                "name": "TL-SF1005D",
                "description": "Коммутатор неуправляемый 5x10/100BASE-TX",
                "img": "tl_sf1005d.jpg",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 586,
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Сетевые коммутаторы",
                "manufacturer": "TP-Link",
                "name": "TL-SF1008D",
                "description": "Коммутатор неуправляемый, настольный, порты 10-100Base-TX: 8 шт.",
                "img": "tl_sf1008d.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 686,
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Сетевые коммутаторы",
                "manufacturer": "IPS",
                "name": "IPS-1004F",
                "description": "Коммутатор 5-ти портовый, 4 PoE",
                "img": "",
                "type": 1,
                "streams": 4,
                "units": "шт",
                "price": 5610,
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Сетевые коммутаторы",
                "manufacturer": "IPS",
                "name": "IPS-1008F",
                "description": "Коммутатор 9-ти портовый, 8 PoE",
                "img": "",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 8980,
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Сетевые коммутаторы",
                "manufacturer": "Just",
                "name": "JT-POE31016P",
                "description": "неуправляемый 18-портовый PoE коммутатор в металлическом корпусе и встроенным блоком питания. 16 портов Ethernet для передачи данных 10/100 Mbps стандарта POE 802.3 af и 2 порта Uplink Gigabit для передачи данных 10/100/1000Мб/с",
                "img": "jt_poe31016p.jpg",
                "type": 1,
                "streams": 16,
                "units": "шт",
                "price": 15810,
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Сетевые коммутаторы",
                "manufacturer": "Just",
                "name": "JT-H1064PL",
                "description": "6-портовый PoE коммутатор со встроенным блоком питани. 6 портов Ethernet для передачи данных 10/100 Mbps, 4 из которых стандарта POE 802.3 af, 802.3 at.,поддерживает передачу данных до 250м*10М",
                "img": "jt_h1004p.jpg",
                "type": 1,
                "streams": 6,
                "units": "шт",
                "price": 3570,
                "fav": "*",
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Сетевые коммутаторы",
                "manufacturer": "Just",
                "name": "JT-H1108PL",
                "description": "10-портовый PoE коммутатор со встроенным блоком питания. 10 портов Ethernet для передачи данных 10/100 Mbps, 8 из которых стандарта POE 802.3 af, 802.3 at. ,поддерживает передачу данных до 250м*10М.",
                "img": "jt_h1108pl.jpg",
                "type": 1,
                "streams": 8,
                "units": "шт",
                "price": 5610,
                "fav": "*",
                "binding": [
                    "105"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Сетевые коммутаторы"
        },
        "name": "Сетевые коммутаторы",
        "id": 6,
        "type": 1
    },
    {
        "name": "IP-видеосерверы",
        "id": 7,
        "type": 5
    },
    {
        "name": "Дополнительные аксессуары",
        "id": 8,
        "type": 5
    },
    {
        "name": "Пульты управления",
        "id": 9,
        "type": 2
    },
    {
        "name": "Мониторы видеонаблюдения",
        "id": 10,
        "type": 7
    },
    {
        "name": "Термокожухи",
        "id": 11,
        "type": 7
    },
    {
        "name": "Объективы",
        "id": 12,
        "type": 7
    },
    {
        "name": "Комплекты видеодомофон+вызывная панель",
        "id": 13,
        "type": 7
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Purple WD10PURZ",
                "description": "Жесткий диск WD Purple WD10PURZ  форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 1Тб; буферная память 64Мб",
                "img": "wd-purple-wd10purx.jpg",
                "type": 7,
                "streams": 4,
                "units": "шт",
                "price": 4225,
                "fav": "*",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Purple WD20PURZ",
                "description": "Жесткий диск WD Purple WD20PURZ  форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 2Тб; буферная память 64Мб",
                "img": "wd-purple-wd20purx.jpg",
                "type": 7,
                "streams": 8,
                "units": "шт",
                "price": 5920,
                "fav": "*",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Purple WD30PURZ",
                "description": "Жесткий диск WD Purple WD30PURZ форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 3Тб; буферная память 64Мб",
                "img": "wd-purple-wd30purx.jpg",
                "type": 7,
                "streams": 16,
                "units": "шт",
                "price": 7620,
                "fav": "*",
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Purple WD40PURZ",
                "description": "Жесткий диск WD Purple WD40PURZ форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 4Тб; буферная память 64Мб",
                "img": "wd-purple-wd40purx.jpg",
                "type": 7,
                "units": "шт",
                "price": 9600,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Blue WD5000AZLX",
                "description": "Жесткий диск WD WD5000AZLX форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 500Гб; скорость вращения шпинделя 7200об/мин; буферная память 32Мб",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 3368,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Blue",
                "description": "Жесткий диск WD Blue WD10EZRZ, 1Тб, HDD, SATA III, 3.5\"",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 3468,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Blue",
                "description": "Жесткий диск WD Blue WD20EZRZ, 2Тб, HDD, SATA III, 3.5\"",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 4939,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "7": {
                "id": 8,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Blue",
                "description": "Жесткий диск WD Blue WD30EZRZ, 3Тб, HDD, SATA III, 3.5\"",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 70130,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "8": {
                "id": 9,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Blue",
                "description": "Жесткий диск WD Blue WD40EZRZ, 4Тб, HDD, SATA III, 3.5\"",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 8197,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "9": {
                "id": 10,
                "group": "Жесткие диски",
                "manufacturer": "WD",
                "name": "Жесткий диск WD Purple WD60PURZ",
                "description": "Жесткий диск WD Purple WD60PURZ форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 6Тб; буферная память 64Мб",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 15855,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "10": {
                "id": 11,
                "group": "Жесткие диски",
                "manufacturer": "Seagate",
                "name": "Жесткий диск SEAGATE Barracuda ST1000DM010",
                "description": "Жесткий диск SEAGATE SV35 ST1000VX000 форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 1Тб; скорость вращения шпинделя 7200об/мин; буферная память 64Мб",
                "img": "seagate-sv35-st1000vx000.jpg",
                "type": 7,
                "units": "шт",
                "price": 3312,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "11": {
                "id": 12,
                "group": "Жесткие диски",
                "manufacturer": "Seagate",
                "name": "Жесткий диск SEAGATE Barracuda ST1000DM010",
                "description": "Жесткий диск SEAGATE SV35 ST2000VX000 форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 2Тб; скорость вращения шпинделя 7200об/мин; буферная память 64Мб",
                "img": "seagate-sv35-st2000vx000.jpg",
                "type": 7,
                "units": "шт",
                "price": 4435,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "12": {
                "id": 13,
                "group": "Жесткие диски",
                "manufacturer": "Seagate",
                "name": "Жесткий диск SEAGATE Barracuda ST3000DM008",
                "description": "Жесткий диск SEAGATE SV35 ST3000VX000 форм-фактор 3.5\"; тип: HDD; интерфейс: SATA III; объём: 3Тб; скорость вращения шпинделя 7200об/мин; буферная память 64Мб",
                "img": "seagate-sv35-st3000vx000.jpg",
                "type": 7,
                "units": "шт",
                "price": 5962,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Жесткие диски"
        },
        "name": "Жесткие диски",
        "id": 14,
        "type": 7
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Блоки питания",
                "manufacturer": "",
                "name": "Блок питания 1А",
                "description": "Источник питания для камер видеонаблюдения",
                "img": "block_pitaniya_1а.jpg",
                "type": 6,
                "streams": 2,
                "units": "шт",
                "price": 520,
                "fav": "*",
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Блоки питания",
                "manufacturer": "Accordteh",
                "name": "Блок питания ББП-20",
                "description": "ББП-20 (Accordteh) блок питания под АКБ 7 Ач. Uвх. AC 165-264 V, Uвых. DC 13.6 ± 0.2V, 2A (ном.). Габаритные размеры: 164?167?72мм",
                "img": "bbp-20.jpg",
                "type": 6,
                "streams": 4,
                "units": "шт",
                "price": 1150,
                "fav": "*",
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Блоки питания",
                "manufacturer": "",
                "name": "Блок питания ББП-30 исп.1",
                "description": "Блок бесперебойного питания в корпусе под АКБ 7 Ач. Uвх. AC 165-264 V, Uвых. DC 13.3 V, 3A (ном.). Габаритные размеры: 230x150x65мм",
                "img": "bbp-30.jpg",
                "type": 6,
                "streams": 8,
                "units": "шт",
                "price": 1395,
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Блоки питания",
                "manufacturer": "RVI",
                "name": "RVi-P12/1",
                "description": "Источник питания для камер видеонаблюдения; Входное напряжение: ~ 50 Гц 140…265 В; Выходное напряжение: DC 12,3±0,3 В; Ток нагрузки: 0...1 А; Потребляемая мощность: менее 20 Вт; Класс защиты: IP64; Встроенная термозащита от перегрузок; Диапазон рабочих температур: -30 … +50°С; Габаритные размеры: 48х68х25 мм",
                "img": "rvi-p12_1.jpg",
                "type": 6,
                "units": "шт",
                "price": 550,
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Блоки питания",
                "manufacturer": "Accordteh",
                "name": "АТ-12/30",
                "description": "Источник питания 12В 3А (max. 3.5A)\nБлок питания, Uвх=110-240V AC, Uвых=12.6V DC, Iвых = 3,0A (ном.)",
                "img": "at_12_30.jpeg",
                "type": 6,
                "units": "шт",
                "price": 910,
                "fav": "*",
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Блоки питания",
                "manufacturer": "",
                "name": "Блок питания",
                "description": "Источник питания 12В 2А",
                "img": "block_pitaniya_1а.jpg",
                "type": 6,
                "units": "шт",
                "price": 720,
                "fav": "*",
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Блоки питания",
                "manufacturer": "",
                "name": "Блок питания",
                "description": "Источник питания 12В 3А",
                "img": "block_pitaniya_1а.jpg",
                "type": 6,
                "units": "шт",
                "price": 910,
                "fav": "*",
                "cnt": 2,
                "binding": [
                    "120"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Блоки питания"
        },
        "name": "Блоки питания",
        "id": 15,
        "type": 6
    },
    {
        "0": {
            "0": {
                "id": 1,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "РАЗЪЕМ DC",
                "description": "РАЗЪЕМ DC штекер питания с проводом 20 см",
                "img": "dc.jpg",
                "type": 7,
                "units": "шт",
                "price": 35,
                "fav": "*",
                "cnt": 1,
                "cam_type": 6,
                "binding": [
                    "106"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 2,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "РАЗЪЁМ штекер BNC",
                "description": "РАЗЪЁМ штекер BNC под винт с пружиной металл REXANT",
                "img": "bnc.jpg",
                "type": 7,
                "units": "шт",
                "price": 35,
                "fav": "*",
                "cnt": 2,
                "cam_type": 6,
                "binding": [
                    "106"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 3,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "RJ-45 джек (8P8C)",
                "description": "RJ-45 джек (8P8C)",
                "img": "rj-45.jpg",
                "type": 7,
                "units": "шт",
                "price": 10,
                "fav": "*",
                "cnt": 2,
                "cam_type": 1,
                "binding": [
                    "106"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 4,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель КВК-уличный",
                "description": "Кабель КВК-уличный",
                "img": "kvk-out.jpg",
                "type": 7,
                "units": "м",
                "price": 33,
                "cam_type": 6,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 5,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель КВК-внутренний",
                "description": "Кабель КВК-внутренний",
                "img": "kvk-in.jpg",
                "type": 7,
                "units": "м",
                "price": 26,
                "fav": "*",
                "cnt": 10,
                "cam_type": 6,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 6,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель для передачи данных UTP-уличный",
                "description": "Кабель для передачи данных UTP-уличный",
                "img": "utp-out.jpg",
                "type": 7,
                "units": "м",
                "price": 28,
                "cam_type": 1,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 7,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель для передачи данных FTP Stranded",
                "description": "Кабель для передачи данных FTP STRANDED",
                "img": "utp-out.jpg",
                "type": 7,
                "units": "м",
                "price": 38,
                "cam_type": 1,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "7": {
                "id": 8,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель для передачи данных UTP-внутренний",
                "description": "Кабель для передачи данных UTP-внутренний",
                "img": "utp-in.jpg",
                "type": 7,
                "units": "м",
                "price": 24,
                "fav": "*",
                "cnt": 10,
                "cam_type": 1,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "8": {
                "id": 9,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Гофра внутренняя",
                "description": "Гофра внутренняя",
                "img": "gofra-in.jpg",
                "type": 7,
                "units": "м",
                "price": 12,
                "cnt": 10,
                "cam_type": 7,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "9": {
                "id": 10,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Гофра уличная",
                "description": "Гофра уличная",
                "img": "gofra-out.jpg",
                "type": 7,
                "units": "м",
                "price": 14,
                "cam_type": 7,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "10": {
                "id": 11,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Расходные материалы (комплект)",
                "description": "Расходные материалы (комплект)",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "fav": "*",
                "cnt": 1,
                "cam_type": 7,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "11": {
                "id": 12,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель КВК",
                "description": "Кабель КВК (бухта 18 метров)",
                "img": "kvk_18m.jpg",
                "type": 7,
                "units": "м",
                "price": 450,
                "cam_type": 7,
                "binding": [
                    "128"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "12": {
                "id": 13,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель-канал 16*16",
                "description": "Кабель-канал 16*16",
                "img": "cable_box_16.jpg",
                "type": 7,
                "units": "м",
                "price": 19,
                "cam_type": 7,
                "binding": [
                    "128"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "13": {
                "id": 14,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель-канал 25*16",
                "description": "Кабель-канал 25*16",
                "img": "cable_box_25.jpg",
                "type": 7,
                "units": "м",
                "price": 26,
                "cam_type": 7,
                "binding": [
                    "128"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "14": {
                "id": 15,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель-канал 40*40",
                "description": "Кабель-канал 40*40",
                "img": "cable_box_40.jpg",
                "type": 7,
                "units": "м",
                "price": 58,
                "cam_type": 7,
                "binding": [
                    "128"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "15": {
                "id": 16,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кабель ШВВП 2*0,5",
                "description": "Кабель ШВВП 2*0,5",
                "img": "cable_hvvp_2-0,5.jpg",
                "type": 7,
                "units": "м",
                "price": 12,
                "cam_type": 7,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "16": {
                "id": 17,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Провод ШВВП (ПУГНП) 3х2,5",
                "description": "Провод ШВВП (ПУГНП) 3х2,5",
                "img": "cable_hvvp_3-2,5.jpg",
                "type": 7,
                "units": "м",
                "price": 34,
                "cam_type": 7,
                "binding": [
                    "108"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "17": {
                "id": 18,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Трос стальной",
                "description": "Трос стальной",
                "img": "rope.jpg",
                "type": 7,
                "units": "м",
                "price": 12,
                "cam_type": 7,
                "binding": [
                    "127"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "18": {
                "id": 19,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Розетка",
                "description": "Розетка 1-местная",
                "img": "power_socket_1.jpg",
                "type": 7,
                "units": "шт",
                "price": 250,
                "cam_type": 7,
                "binding": [
                    "126"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "19": {
                "id": 20,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Розетка",
                "description": "Розетка 2-местная",
                "img": "power_socket_2.jpg",
                "type": 7,
                "units": "шт",
                "price": 450,
                "cam_type": 7,
                "binding": [
                    "126"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "20": {
                "id": 21,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Распаячная коробка",
                "description": "Распаячная коробка",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 100,
                "cam_type": 7,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "21": {
                "id": 22,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Wi-Fi мост (комплект)",
                "description": "Wi-Fi мост (комплект)",
                "img": "wi_fi_bridge.jpg",
                "type": 7,
                "units": "шт",
                "price": 14960,
                "cam_type": 5,
                "binding": [
                    "114"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "22": {
                "id": 23,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Металлический ящик",
                "description": "Металлический ящик",
                "img": "metal_box.jpg",
                "type": 7,
                "units": "шт",
                "price": 1500,
                "cam_type": 3,
                "binding": [
                    "113"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "23": {
                "id": 24,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Чувствительный микрофон",
                "description": "Чувствительный микрофон",
                "img": "microphone.png",
                "type": 7,
                "units": "шт",
                "price": 850,
                "cam_type": 3,
                "binding": [
                    "115"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "24": {
                "id": 25,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Монитор 18,5\"",
                "description": "размер экрана: 18.5\", с разрешением 1366?768, отношением сторон 16:9, яркостью 200кд/м2",
                "img": "display.jpg",
                "type": 7,
                "units": "шт",
                "price": 5050,
                "cam_type": 3,
                "binding": [
                    "112"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "25": {
                "id": 26,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Монитор 21,5\"",
                "description": "размер экрана: 21.5\",  с разрешением 1920?1080, отношением сторон 16:9, яркостью 250кд/м2",
                "img": "display.jpg",
                "type": 7,
                "units": "шт",
                "price": 6195,
                "cam_type": 3,
                "binding": [
                    "112"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "26": {
                "id": 27,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Сим-карта",
                "description": "Билайн",
                "img": "bilain.jpg",
                "type": 7,
                "units": "шт",
                "price": 500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "27": {
                "id": 28,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Сим-карта",
                "description": "Мегафон",
                "img": "megafon.jpg",
                "type": 7,
                "units": "шт",
                "price": 500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "28": {
                "id": 29,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Антенна выносная",
                "description": "Антенна LTE Station M14 - решение, заключающееся в комбинировании модема и маршрутизатора в одном защищённом корпусе вместе с антенной, имеющей высокий коэффициент усиления, благодаря чему минимизируются потери сигнала в кабеле",
                "img": "lte_station_m14.jpg",
                "type": 7,
                "units": "шт",
                "price": 10500,
                "binding": [
                    "130"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "29": {
                "id": 30,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Антенна выносная",
                "description": "Антенна LTE Station M18 - внешний (всепогодный) клиент LTE со встроенной  MIMO  антенной 18 дБ",
                "img": "lte_station_m18.jpg",
                "type": 7,
                "units": "шт",
                "price": 12000,
                "binding": [
                    "130"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "30": {
                "id": 31,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Антенна выносная",
                "description": "Антенна VideoStation M20x4 - всепогодное устройство с интегрированной мощной MIMO антенной для приема сигнала 3G/4G на расстоянии до 15 км. от базовой станции, с возможностью одновременного подключения 4-х IP камер",
                "img": "videostation_m20x4.png",
                "type": 7,
                "units": "шт",
                "price": 19000,
                "binding": [
                    "130"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "31": {
                "id": 32,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Флеш-карта",
                "description": "Флеш-карта 16 Гб, 10 класс",
                "img": "sd.jpg",
                "type": 7,
                "units": "шт",
                "price": 480,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "32": {
                "id": 33,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Флеш-карта",
                "description": "Флеш-карта 32 Гб, 10 класс",
                "img": "sd.jpg",
                "type": 7,
                "units": "шт",
                "price": 720,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "33": {
                "id": 34,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Флеш-карта",
                "description": "Флеш-карта 64 Гб, 10 класс",
                "img": "sd.jpg",
                "type": 7,
                "units": "шт",
                "price": 1315,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "34": {
                "id": 35,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Флеш-карта",
                "description": "Флеш-карта 128 Гб, 10 класс",
                "img": "sd.jpg",
                "type": 7,
                "units": "шт",
                "price": 1725,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "35": {
                "id": 36,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Модем",
                "description": "Модем Huawei 3G/4G",
                "img": "modem_huawei_.jpg",
                "type": 7,
                "units": "шт",
                "price": 2600,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "36": {
                "id": 37,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Модем",
                "description": "Модем Билайн 3G/4G",
                "img": "modem_bilain.jpg",
                "type": 7,
                "units": "шт",
                "price": 2978,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "37": {
                "id": 38,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Роутер",
                "description": "Беспроводной роутер KEENETIC 4G",
                "img": "keenetic_4g.jpg",
                "type": 7,
                "units": "шт",
                "price": 2748,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "38": {
                "id": 39,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Распаячная коробка",
                "description": "LTB347 Монтажная коробка для купольных камер",
                "img": "ltb347.jpg",
                "type": 7,
                "units": "шт",
                "price": 1100,
                "binding": [
                    "133"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "39": {
                "id": 40,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Распаячная коробка",
                "description": "DS-1280ZJ-S Монтажная коробка",
                "img": "ds_1280zj_s.jpg",
                "type": 7,
                "units": "шт",
                "price": 2190,
                "binding": [
                    "134"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "40": {
                "id": 41,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кронштейн",
                "description": "Настенный кронштейн RVi-BW3",
                "img": "rvi_bw3___rvi_bw4.jpg",
                "type": 7,
                "units": "шт",
                "price": 990,
                "binding": [
                    "134"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "41": {
                "id": 42,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Кронштейн",
                "description": "Настенный кронштейн RVi-BW4",
                "img": "rvi_bw3___rvi_bw4.jpg",
                "type": 7,
                "units": "шт",
                "price": 1100,
                "binding": [
                    "133"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "42": {
                "id": 43,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Распаячная коробка",
                "description": "Монтажная коробка RVi-MB2",
                "img": "rvi_mb2.jpg",
                "type": 7,
                "units": "шт",
                "price": 2200,
                "binding": [
                    "133"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "43": {
                "id": 44,
                "group": "Необходимое оборудование",
                "manufacturer": "",
                "name": "Удлинитель PoE",
                "description": "IP04 Удлинитель PoE по кабелю UTP CAT5e. Увеличивает расстояние передачи подключения удаленного устройства на расстояние до 100 м. При применении каскадной схемы включения, расстояние подключения увеличивается до 600 м",
                "img": "ip04.jpg",
                "type": 7,
                "units": "шт",
                "price": 4948,
                "binding": [
                    "134"
                ],
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Необходимое оборудование"
        },
        "name": "Необходимое оборудование",
        "id": 16,
        "type": 7
    },
    {
        "0": {
            "0": {
                "id": 101,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка внутренней ip камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2050,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "1": {
                "id": 102,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка уличной ip камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2550,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "2": {
                "id": 103,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка ip скоростной поворотной камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 4500,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "3": {
                "id": 104,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и настройка ip видеорегистратора",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2700,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "4": {
                "id": 105,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Юстировка камеры",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 450,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "5": {
                "id": 106,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Подключение разъемов",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 30,
                "cnt": 2,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "6": {
                "id": 107,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и подключение ip коммутатора",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 800,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "7": {
                "id": 108,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Прокладка кабельной продукции",
                "description": "",
                "img": "",
                "type": 7,
                "units": "м",
                "price": 50,
                "cnt": 25,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "8": {
                "id": 109,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Подключение линий к видеорегистратору",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "9": {
                "id": 110,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Пуско-наладочные работы",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 0,
                "rate": 15,
                "fav": "*",
                "cam_type": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "10": {
                "id": 111,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Настройка удаленного доступа",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 1500,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "11": {
                "id": 112,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и подключение монитора",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "12": {
                "id": 113,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка металлического ящика",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "13": {
                "id": 114,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка, подключение и настройка Wi-Fi моста (комплект)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 3500,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "14": {
                "id": 115,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и подключение микрофона",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 450,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "15": {
                "id": 116,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка аналоговой внутренней камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 1700,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "16": {
                "id": 117,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка аналоговой уличной камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2050,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "17": {
                "id": 118,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка аналоговой скоростной поворотной камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 3550,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "18": {
                "id": 119,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и настройка аналового видеорегистратора",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "19": {
                "id": 120,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка блока питания",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "20": {
                "id": 121,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Пуско-наладочные работы",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 0,
                "rate": 10,
                "fav": "*",
                "cam_type": 2,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "21": {
                "id": 122,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка внутренней hd камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 1700,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "22": {
                "id": 123,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка уличной hd камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2050,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "23": {
                "id": 124,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка hd скоростной поворотной камеры (высота установки до 3х метров)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 4500,
                "cnt": 1,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "24": {
                "id": 125,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка и настройка hd видеорегистратора",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "25": {
                "id": 126,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка розетки",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 600,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "26": {
                "id": 127,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Протяжка стального троса",
                "description": "",
                "img": "",
                "type": 7,
                "units": "м",
                "price": 55,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "27": {
                "id": 128,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Прокладка короба",
                "description": "",
                "img": "",
                "type": 7,
                "units": "м",
                "price": 50,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "28": {
                "id": 129,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Монтаж выносной антенны",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 2500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "29": {
                "id": 130,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Пополнение сим-карты",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 900,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "30": {
                "id": 131,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Настройка роутера",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 1500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "31": {
                "id": 132,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка кронштейна",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 300,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "32": {
                "id": 133,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Установка распаячной коробки",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 200,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "33": {
                "id": 134,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Подключение удлинителя PoE",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "34": {
                "id": 135,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Пуско-наладочные работы",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 0,
                "rate": 17,
                "fav": "*",
                "cam_type": 4,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "35": {
                "id": 136,
                "group": "Монтажные работы",
                "manufacturer": "",
                "name": "Транспортные расходы (выезд за пределы МКАД до 30 км, свыше оплачивается допольнительно)",
                "description": "",
                "img": "",
                "type": 7,
                "units": "шт",
                "price": 500,
                "sku": "",
                "link": "",
                "youtube": "",
                "gid": 0
            },
            "name": "Монтажные работы"
        },
        "name": "Работы",
        "id": 17,
        "type": 7
    },
    [{
            "id": 1,
            "position": "Менеджер отдела продаж",
            "name": "Собещанская Ирина",
            "email": "irina@texno-proekt.ru",
            "phones": "8(495)989-77-49, 8(965)160-62-60",
            "additional": ""
        },
        {
            "id": 2,
            "position": "Руководитель проектов",
            "name": "Костецкий Виталий",
            "email": "info@texno-proekt.ru",
            "phones": "8(495)989-77-49, 8(967)080-88-88",
            "additional": ""
        },
        {
            "id": 3,
            "position": "Генеральный директор",
            "name": "Костецкая Юлия",
            "email": "juliya@texno-proekt.ru",
            "phones": "8(495)989-77-49, 8(965)163-30-03",
            "additional": ""
        },
        {
            "id": 4,
            "position": "Инженер",
            "name": "Новиков Сергей",
            "email": "novikov@texno-proekt.ru",
            "phones": "8(495)989-77-49, 8(965)162-63-64",
            "additional": ""
        }
    ],
    [{
            "id": 1,
            "group": "Скидки",
            "price": 0,
            "rate": 20
        },
        {
            "id": 2,
            "group": "Скидки",
            "price": 0,
            "rate": 20
        },
        {
            "id": 3,
            "group": "Скидки",
            "price": 0,
            "rate": 20
        },
        {
            "id": 4,
            "group": "Скидки",
            "price": 0,
            "rate": 18
        },
        {
            "id": 5,
            "group": "Скидки",
            "price": 0,
            "rate": 18
        },
        {
            "id": 6,
            "group": "Скидки",
            "price": 0,
            "rate": 18
        }
    ]
];
        r = h;
        setTimeout(function() {
            b("#fixed-left-div").portamento({
                wrapper: b("#wrapper-calc"),
                gap: 60
            });
            E();
            m = 0;
            K(r);
            c.ip.cam = [];
            c.ip.additional = x(c.ip);
            c.ip.works = w(c.ip);
            c.analog.cam_type = 1;
            c.analog.cam = [];
            c.analog.additional = x(c.analog);
            c.analog.works = w(c.analog);
            if (F("d")) {
                var f = decodeURIComponent(F("d"));
                L(f)
            } else t(c), u();
            b("#invoice_btn").click(function(b) {
                b.preventDefault()
            })
        }, 0);
        b(".add-btn").magnificPopup({
            type: "inline",
            closeBtnInside: !0,
            preloader: !1,
            midClick: !0,
            removalDelay: 0,
            mainClass: "my-mfp-zoom-in",
            callbacks: {
                open: function() {
                    y = 0;
                    z = ""
                }
            }
        });
        b("input[name=installation-radio]").click(function() {
            var f = c.ip;
            1 == m && (f = c.analog);
            2 == m && (f = c.hd);
            1 == parseInt(b(this).val()) ? f.works = w(f) : f.works = [];
            t(c);
            u()
        });
        b("#pdf_btn").click(function() {
            var f = b.extend({}, c.ip);
            1 == m && (f = b.extend({}, c.analog));
            2 == m && (f = b.extend({}, c.hd));
            var d = b("#name_download"),
                e = b("#email_download"),
                g = b("#phone_download"),
                l = !0;
            b([]).add(d).add(e).add(g).removeClass("calc-error");
            if (l = (l = (l = (l = l && A(d, "name_download", 2, 16)) && A(e, "email_download", 6, 80)) && A(g, "phone_download", 4, 30)) && G(e, /^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/i,
                    "")) f.orderid = c.orderid, f.cam_type = m, f.client_name = d.val(), f.client_phone = g.val(), f.client_email = e.val(), f.manager_id = 0, b("#frm_format").val("pdf"), "invoice_btn_xls" == b(this).attr("id") && b("#frm_format").val("xls"), b("#frm_data").val(JSON.stringify(f)), b("#invoice_frm").submit()
        })
    b.getJSON(files_path + "calc.php", {
        format: "json"
    }, function(h) {
        r = h;
        setTimeout(function() {
            b("#fixed-left-div").portamento({
                wrapper: b("#wrapper-calc"),
                gap: 60
            });
            E();
            m = 0;
            K(r);
            c.ip.cam = [];
            c.ip.additional = x(c.ip);
            c.ip.works = w(c.ip);
            c.analog.cam_type = 1;
            c.analog.cam = [];
            c.analog.additional = x(c.analog);
            c.analog.works = w(c.analog);
            if (F("d")) {
                var f = decodeURIComponent(F("d"));
                L(f)
            } else t(c), u();
            b("#invoice_btn").click(function(b) {
                b.preventDefault()
            })
        }, 0);
        b(".add-btn").magnificPopup({
            type: "inline",
            closeBtnInside: !0,
            preloader: !1,
            midClick: !0,
            removalDelay: 0,
            mainClass: "my-mfp-zoom-in",
            callbacks: {
                open: function() {
                    y = 0;
                    z = ""
                }
            }
        });
        b("input[name=installation-radio]").click(function() {
            var f = c.ip;
            1 == m && (f = c.analog);
            2 == m && (f = c.hd);
            1 == parseInt(b(this).val()) ? f.works = w(f) : f.works = [];
            t(c);
            u()
        });
        b("#pdf_btn").click(function() {
            var f = b.extend({}, c.ip);
            1 == m && (f = b.extend({}, c.analog));
            2 == m && (f = b.extend({}, c.hd));
            var d = b("#name_download"),
                e = b("#email_download"),
                g = b("#phone_download"),
                l = !0;
            b([]).add(d).add(e).add(g).removeClass("calc-error");
            if (l = (l = (l = (l = l && A(d, "name_download", 2, 16)) && A(e, "email_download", 6, 80)) && A(g, "phone_download", 4, 30)) && G(e, /^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/i,
                    "")) f.orderid = c.orderid, f.cam_type = m, f.client_name = d.val(), f.client_phone = g.val(), f.client_email = e.val(), f.manager_id = 0, b("#frm_format").val("pdf"), "invoice_btn_xls" == b(this).attr("id") && b("#frm_format").val("xls"), b("#frm_data").val(JSON.stringify(f)), b("#invoice_frm").submit()
        })
    }).fail(function() {
        jAlert("Произошла ошибка при получении данных с сервера. <br />Повторите попытку позже.",
            "Ошибка")
    });
    */
    var F = function(b) {
            for (var c = window.location.search.substring(1).split("&"), d = 0; d < c.length; d++) {
                var e = c[d].split("=");
                if (e[0] == b) return e[1]
            }
        },
        E = function() {
            c.ip.cam = [];
            c.ip.additional = [];
            c.ip.required = [];
            c.ip.works = [];
            c.ip.cam_total = 0;
            c.ip.cam_discount = 0;
            c.ip.add_total = 0;
            c.ip.add_discount = 0;
            c.ip.req_total = 0;
            c.ip.wrk_total = 0;
            c.ip.wrk_discount = 0;
            c.ip.cam_type = 0;
            c.ip.discount_eq = 0;
            c.ip.discount_wr = 0;
            c.analog.cam = [];
            c.analog.additional = [];
            c.analog.required = [];
            c.analog.works = [];
            c.analog.cam_total = 0;
            c.analog.cam_discount = 0;
            c.analog.add_total = 0;
            c.analog.add_discount = 0;
            c.analog.req_total = 0;
            c.analog.wrk_total = 0;
            c.analog.wrk_discount = 0;
            c.analog.cam_type = 1;
            c.analog.discount_eq = 0;
            c.analog.discount_wr = 0;
            c.hd.cam = [];
            c.hd.additional = [];
            c.hd.required = [];
            c.hd.works = [];
            c.hd.cam_total = 0;
            c.hd.cam_discount = 0;
            c.hd.add_total = 0;
            c.hd.add_discount = 0;
            c.hd.req_total = 0;
            c.hd.wrk_total = 0;
            c.hd.wrk_discount = 0;
            c.hd.cam_type = 2;
            c.hd.discount_eq = 0;
            c.hd.discount_wr = 0;
            c.orderid = 0;
            m = c.state =
                0;
            b("#name").val("");
            b("#phone").val("");
            b("#email").val("");
            b("#comment").val("");
            b("#order_number").html("*");
            b("#order_date").val(b.datepicker.formatDate("dd.mm.yy", new Date));
            b("#form_message").hide();
            b("#files_upload_div").hide();
            b(".file-details").hide()
        };
    b(".type-cctv").click(function() {
        b(".type-cctv").removeClass("selected");
        b(this).addClass("selected");
        "calc_hdd" == b(this).attr("id") ? (b(".list-items").hide(), b("#orderform-container").hide(), b("#calc_hdd_div").show(), b(".calc-bottom").hide(),
            b(".calc-links").hide()) : (b(".list-items").show(), b("#orderform-container").hide(), b("#calc_hdd_div").hide(), b(".calc-bottom").show(), b(".calc-links").show(), m = 0, "cctv_analog" == b(this).attr("id") && (m = 1), "cctv_hd" == b(this).attr("id") && (m = 2), t(c), 0 == m && (b("#cctv_title,#wn-cam-type").html("IP камеры видеонаблюдения"), b("#wn-camera1-sel-content").show(), b("#wn-camera2-sel-content").hide(), b("#wn-camera3-sel-content").hide(),
            b("#wn-cam-ip").click(), b("#wn-camera2-sel-content").hide(), b("#wn-additional1-sel-content").show(), b("#wn-additional2-sel-content").hide(), b("#wn-additional3-sel-content").hide(), b("#wn-add-ip").click(), b("#wn-works1-sel-content").show(), b("#wn-works2-sel-content").hide(), b("#wn-works3-sel-content").hide()), 1 == m && (b("#cctv_title,#wn-cam-type").html("Аналоговые камеры видеонаблюдения"),
            b("#wn-camera2-sel-content").show(), b("#wn-camera1-sel-content").hide(), b("#wn-camera3-sel-content").hide(), b("#wn-cam-analog").click(), b("#wn-additional1-sel-content").hide(), b("#wn-additional2-sel-content").show(), b("#wn-additional3-sel-content").hide(), b("#wn-add-analog").click(), b("#wn-works1-sel-content").hide(), b("#wn-works2-sel-content").show(), b("#wn-works3-sel-content").hide()), 2 == m && (b("#cctv_title,#wn-cam-type").html("HD камеры видеонаблюдения"),
            b("#wn-camera1-sel-content").hide(), b("#wn-camera2-sel-content").hide(), b("#wn-camera3-sel-content").show(), b("#wn-cam-hd").click(), b("#wn-additional1-sel-content").hide(), b("#wn-additional2-sel-content").hide(), b("#wn-additional3-sel-content").show(), b("#wn-add-hd").click(), b("#wn-works1-sel-content").hide(), b("#wn-works2-sel-content").hide(), b("#wn-works3-sel-content").show()), u())
    });
    var q = function(b, c, d) {
            c = "undefined" != typeof c ? c : 2;
            d = "undefined" != typeof d ? d : "";
            b = parseFloat(b);
            var e = Math.pow(10,
                c);
            b = Math.round(b * e) / e;
            c = Number(b).toFixed(c).toString().split(".");
            d = c[0].replace(/(\d{1,3}(?=(\d{3})+(?:\.\d|\b)))/g, "$1" + d);
            return b = c[1] ? d + "." + c[1] : d
        },
        K = function(h) {
            b("#wn-camera1-sel-content").html("");
            b("#wn-camera2-sel-content").html("");
            b("#wn-camera3-sel-content").html("");
            for (n = 0; 3 > n; n++) b.each(h[n], function(e, d) {
                if ("object" === typeof d) {
                    var g = b(".group-cameras-div-tpl").clone();
                    g.removeClass("group-cameras-div-tpl");
                    var c = "group-cam1";
                    2 == h[n].type && (c = "group-cam2");
                    4 == h[n].type && (c = "group-cam3");
                    b(".group-items-title", g).addClass(c);
                    b(".group-items-content", g).addClass(c);
                    g.addClass("group-close");
                    b(".open-close-icon", g).addClass("close");
                    b(".sel_wnd_item_title", g).html(d.name);
                    b.each(d, function(d, c) {
                        if (void 0 != c.name) {
                            var l = b(".wn-camera-line-tpl").clone();
                            l.removeClass("wn-camera-line-tpl");
                            0 == d && l.addClass("first-line");
                            var h = files_path + "images/products/" + c.img;
                            "" == c.img && (h = no_foto_img);
                            b(".camera_sel_img", l).attr("src", h);
                            h = c.sku;
                            "" != h && (h = "Артикул: " +
                                h);
                            b(".item-article", l).html(h);
                            b(".item-name", l).html(c.name).attr("id", "addcam1_" + n + "_" + e + "_" + d);
                            b(".item-description-span", l).html(c.description);
                            b(".item-description-span", l).attr("title", c.description).tooltip();
                            b(".item-price", l).html(q(c.price, 0, " "));
                            b(".wn-add-btn", l).attr("id", "addcam_" + n + "_" + e + "_" + d);
                            l.show();
                            b(".group-items-content", g).append(l)
                        }
                    });
                    b(".open-close-icon span:first", g).removeClass("close").addClass("open");
                    g.show();
                    1 == h[n].type && b("#wn-camera1-sel-content").append(g);
                    2 ==
                        h[n].type && b("#wn-camera2-sel-content").append(g.clone());
                    4 == h[n].type && b("#wn-camera3-sel-content").append(g.clone())
                }
            });
            b("#wn-additional-sel1-content").html("");
            b("#wn-additional-sel2-content").html("");
            b("#wn-additional-sel3-content").html("");
            for (n = 3; 17 > n; n++) {
                var f = h[n].name;
                b.each(h[n], function(e, d) {
                    if ("object" === typeof d) {
                        var g = b(".group-additional-div-tpl").clone();
                        g.removeClass("group-additional-div-tpl");
                        g.addClass("group-close");
                        b(".open-close-icon", g).addClass("close");
                        tmp = d.name;
                        tmp !=
                            f && (tmp = f + ". " + d.name);
                        b(".sel_wnd_item_title", g).html(tmp);
                        b.each(d, function(d, c) {
                            if (void 0 != c.name) {
                                var l = b(".wn-additional-line-tpl").clone();
                                l.removeClass("wn-additional-line-tpl");
                                0 == d && l.addClass("first-line");
                                var h = files_path + "images/products/" + c.img;
                                "" == c.img && (h = no_foto_img);
                                b(".additional_sel_img", l).attr("src", h);
                                h = c.sku;
                                "" != h && (h = "Артикул: " + h);
                                b(".item-article", l).html(h);
                                b(".item-name", l).html(c.name).attr("id", "addadt1_" + n + "_" + e + "_" + d);
                                b(".item-description-span",
                                    l).html(c.description);
                                b(".item-description-span", l).attr("title", c.description).tooltip();
                                b(".item-price", l).html(q(c.price, 0, " "));
                                b(".wn-add-btn", l).attr("id", "addadt_" + n + "_" + e + "_" + d);
                                l.show();
                                b(".group-items-content", g).append(l)
                            }
                        });
                        g.show();
                        0 != (h[n].type & 1) && b("#wn-additional1-sel-content").append(g.clone());
                        0 != (h[n].type & 2) && b("#wn-additional2-sel-content").append(g.clone());
                        0 != (h[n].type & 4) && b("#wn-additional3-sel-content").append(g)
                    }
                })
            }
            f = h[17].name;
            b.each(h[17], function(d, g) {
                if ("object" ===
                    typeof g) {
                    var e = b(".group-works-div-tpl").clone();
                    e.removeClass("group-works-div-tpl");
                    b.each(g, function(g, c) {
                        if (void 0 != c.name) {
                            var l = b(".wn-works-line-tpl").clone();
                            l.removeClass("wn-works-line-tpl");
                            0 == g && l.addClass("first-line");
                            b(".item-name", l).html(c.name).attr("id", "addwrk1_" + n + "_" + d + "_" + g);
                            b(".item-price", l).html(q(c.price, 0, " "));
                            b(".wn-add-btn", l).attr("id", "addwrk_" + n + "_" + d + "_" + g);
                            l.show();
                            e.append(l)
                        }
                    });
                    e.show();
                    0 != (h[n].type & 1) && b("#wn-works1-sel-content").append(e.clone());
                    0 != (h[n].type &
                        2) && b("#wn-works2-sel-content").append(e.clone());
                    0 != (h[n].type & 4) && b("#wn-works3-sel-content").append(e.clone())
                }
            });
            b(".group-items-title").click(function() {
                var d = "";
                b(this).hasClass("group-cam1") && (d = "group-cam1");
                b(this).hasClass("group-cam2") && (d = "group-cam2");
                b(this).hasClass("group-cam3") && (d = "group-cam3");
                b(this).hasClass("group-files") && (d = "group-files");
                b(this).hasClass("group-additional") && (d = "group-additional");
                b(".group-items-content." + d).hide("blind", "fast");
                b(".group-items-content." +
                    d).parent().addClass("group-close");
                b(".group-items-content." + d).find(".open-close-icon").removeClass("open").addClass("close");
                b(this).parent().parent().find(".open-close-icon").removeClass("open").addClass("close");
                b(this).parent().find(".group-items-content").is(":visible") ? (b(this).parent().find(".group-items-content").hide("blind", "fast"), b(this).parent().addClass("group-close"), b(this).find(".open-close-icon").removeClass("open").addClass("close")) : (b(this).parent().find(".group-items-content").show("blind",
                    "fast"), b(this).parent().removeClass("group-close"), b(this).find(".open-close-icon").removeClass("close").addClass("open"))
            });
            var d = function(d, g, l, h) {
                b.magnificPopup.close();
                var e = c.ip;
                1 == m && (e = c.analog);
                2 == m && (e = c.hd);
                switch (d) {
                    case "addcam":
                    case "addcam1":
                        d = e.cam.length;
                        1 == y ? (d = z.split("_"), d = parseInt(d[1]), e.cam[d] = b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)])) : e.cam.push(b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)]));
                        e.cam[d].cnt = 1;
                        e.cam[d].discount = 0; - 1 != b.inArray(e.cam[d].manufacturer.toUpperCase(),
                            p) && (e.cam[d].discount = v(b.inArray(e.cam[d].manufacturer.toUpperCase())));
                        e.additional = x(e);
                        e.works = w(e);
                        if (void 0 != e.cam[d].binding) {
                            var f = [];
                            b.each(e.cam[d].binding, function(d, g) {
                                var c = 0;
                                for (k = 0; k < e.works.length; k++)
                                    if (e.works[k].id == parseInt(g)) {
                                        e.works[k].cnt++;
                                        c = 1;
                                        break
                                    } 0 == c && b.each(r[17], function(d, e) {
                                    "object" === typeof e && b.each(e, function(d, e) {
                                        "object" === typeof e && e.id == parseInt(g) && (f.push(b.extend({}, e)), f[f.length - 1].cnt = 1, f[f.length - 1].discount = 0, -1 != b.inArray(f[f.length - 1].manufacturer.toUpperCase(),
                                            p) && (f[f.length - 1].discount = v(b.inArray(f[f.length - 1].manufacturer.toUpperCase(), p))))
                                    })
                                })
                            });
                            b.each(f, function(d, g) {
                                e.works.push(b.extend({}, g))
                            })
                        }
                        break;
                    case "addadt":
                    case "addadt1":
                        d = e.additional.length;
                        1 == y ? (d = z.split("_"), d = parseInt(d[1]), e.additional[d] = b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)])) : e.additional.push(b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)]));
                        e.additional[d].cnt = 1;
                        e.additional[d].discount = 0; - 1 != b.inArray(e.additional[d].manufacturer.toUpperCase(), p) && (e.additional[d].discount =
                            v(b.inArray(e.additional[d].manufacturer.toUpperCase(), p)));
                        void 0 != e.additional[d].binding && (f = [], b.each(e.additional[d].binding, function(d, g) {
                            var c = 0;
                            for (k = 0; k < e.works.length; k++)
                                if (e.works[k].id == parseInt(g)) {
                                    e.works[k].cnt++;
                                    c = 1;
                                    break
                                } 0 == c && b.each(r[17], function(d, e) {
                                "object" === typeof e && b.each(e, function(d, e) {
                                    "object" === typeof e && e.id == parseInt(g) && (f.push(b.extend({}, e)), f[f.length - 1].cnt = 1, f[f.length - 1].discount = 0, -1 != b.inArray(f[f.length - 1].manufacturer.toUpperCase(), p) && (f[f.length - 1].discount =
                                        v(b.inArray(f[f.length - 1].manufacturer.toUpperCase(), p))))
                                })
                            })
                        }), b.each(f, function(d, g) {
                            e.works.push(b.extend({}, g))
                        }));
                        break;
                    case "addwrk":
                    case "addwrk1":
                        d = e.works.length, 1 == y ? (d = z.split("_"), d = parseInt(d[1]), e.works[d] = b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)])) : e.works.push(b.extend({}, r[parseInt(g)][parseInt(l)][parseInt(h)])), e.works[d].cnt = 1, e.works[d].discount = 0
                }
                t(c);
                u()
            };
            b(".wn-add-btn, .item-name").click(function() {
                var e = b(this).attr("id").split("_");
                d(e[0], e[1], e[2], e[3]);
                y = 0;
                z = ""
            });
            b("#add_btn").click(function() {
                var b = c.ip;
                1 == m && (b = c.analog);
                2 == m && (b = c.hd);
                if (0 != b.additional.length || 0 != b.works.length) b = c.ip, 1 == m && (b = c.analog), 2 == m && (b = c.hd);
                b.additional = x(b);
                b.works = w(b);
                t(c);
                u()
            });
            b("#clear_btn").click(function() {
                var b = c.ip;
                1 == m && (b = c.analog);
                2 == m && (b = c.hd);
                b.works = [];
                t(c);
                u()
            })
        },
        x = function(c) {
            a = [];
            for (var f = 0, d = 0; d < c.cam.length; d++) c.cam[d].type ? c.cam[d].type == 1 << c.cam_type && (f += c.cam[d].cnt) : (c.cam[d].type = 1 << c.cam_type, f += c.cam[d].cnt);
            if (0 != f) {
                d = [3 + c.cam_type, 6,
                    14, 15
                ];
                for (var e = 0; e < d.length; e++) {
                    var g = {},
                        l = 0;
                    0 != (r[d[e]].type & 1 << c.cam_type) && (b.each(r[d[e]], function(d, e) {
                        "object" === typeof e && 0 == l && b.each(e, function(d, e) {
                            "object" === typeof e && 0 == l && e.hasOwnProperty("fav") && (e.streams >= f ? (a.push(b.extend({}, e)), a[a.length - 1].cnt = 1, a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p))), l = 1) : g = e)
                        })
                    }), 0 == l && (a.push(b.extend({}, g)), a[a.length - 1].cnt = Math.ceil(f /
                        g.streams), a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p)))))
                }
                b.each(r[16], function(d, e) {
                    "object" === typeof e && b.each(e, function(d, e) {
                        "object" !== typeof e || !e.hasOwnProperty("fav") || e.hasOwnProperty("cam_type") && 0 == (e.cam_type & 1 << c.cam_type) || (a.push(b.extend({}, e)), e.hasOwnProperty("cnt") ? a[a.length - 1].cnt = e.cnt * f : a[a.length - 1].cnt = f, a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length -
                            1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p))))
                    })
                })
            }
            for (e = 0; 3 > e; e++) {
                f = 0;
                var h = e;
                if (h != c.cam_type) {
                    for (d = 0; d < c.cam.length; d++) c.cam[d].type ? c.cam[d].type == 1 << h && (f += c.cam[d].cnt) : (c.cam[d].type = 1 << h, f += c.cam[d].cnt);
                    if (0 != f) {
                        d = [3 + h, 6, 14, 15];
                        for (e = 0; e < d.length; e++) g = {}, l = 0, 0 != (r[d[e]].type & 1 << h) && (b.each(r[d[e]], function(d, e) {
                            "object" === typeof e && 0 == l && b.each(e, function(d, e) {
                                "object" === typeof e && 0 == l && e.hasOwnProperty("fav") && (e.streams >=
                                    f ? (a.push(b.extend({}, e)), a[a.length - 1].cnt = 1, a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p))), l = 1) : g = e)
                            })
                        }), 0 == l && (a.push(b.extend({}, g)), a[a.length - 1].cnt = Math.ceil(f / g.streams), a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p)))));
                        b.each(r[16], function(d, e) {
                            "object" ===
                            typeof e && b.each(e, function(d, e) {
                                "object" !== typeof e || !e.hasOwnProperty("fav") || e.hasOwnProperty("cam_type") && 0 == (e.cam_type & 1 << h) || (a.push(b.extend({}, e)), e.hasOwnProperty("cnt") ? a[a.length - 1].cnt = e.cnt * f : a[a.length - 1].cnt = f, a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p))))
                            })
                        })
                    }
                }
            }
            return a
        },
        H = function(c) {
            var f = {};
            b.each(c.cam, function(d, e) {
                void 0 != e.binding && b.each(e.binding, function(b,
                    d) {
                    void 0 == f[parseInt(d)] && (f[parseInt(d)] = 0);
                    f[parseInt(d)] += parseInt(e.cnt)
                })
            });
            b.each(c.additional, function(d, e) {
                void 0 != e.binding && b.each(e.binding, function(b, d) {
                    void 0 == f[parseInt(d)] && (f[parseInt(d)] = 0);
                    f[parseInt(d)] += parseInt(e.cnt)
                })
            });
            b.each(c.works, function(d, e) {
                b.each(f, function(g, c) {
                    parseInt(g) == e.id && (cnt = c, e.cnt = cnt, b("#wrk_" + d).val(e.cnt))
                })
            })
        },
        w = function(c) {
            a = [];
            var f = {};
            b.each(c.cam, function(d, e) {
                void 0 != e.binding && b.each(e.binding, function(b, d) {
                    void 0 == f[parseInt(d)] && (f[parseInt(d)] =
                        0);
                    f[parseInt(d)] += e.cnt
                })
            });
            b.each(c.additional, function(d, e) {
                void 0 != e.binding && b.each(e.binding, function(b, d) {
                    void 0 == f[parseInt(d)] && (f[parseInt(d)] = 0);
                    f[parseInt(d)] += e.cnt
                })
            });
            b.each(r[17], function(d, e) {
                "object" === typeof e && b.each(e, function(d, e) {
                    if ("object" === typeof e) {
                        var g = 0;
                        b.each(f, function(b, d) {
                            parseInt(b) == e.id && (g = d)
                        });
                        0 < g && (a.push(b.extend({}, e)), a[a.length - 1].cnt = g, a[a.length - 1].discount = 0)
                    }
                })
            });
            b.each(r[17], function(d, e) {
                "object" === typeof e && b.each(e, function(d, e) {
                    "object" !== typeof e ||
                        !e.hasOwnProperty("fav") || e.hasOwnProperty("cam_type") && 0 == (e.cam_type & 1 << c.cam_type) || 0 == a.length || (a.push(b.extend({}, e)), e.hasOwnProperty("cnt") ? a[a.length - 1].cnt = e.cnt * cam_cnt : a[a.length - 1].cnt = 1, a[a.length - 1].discount = 0, -1 != b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p) && (a[a.length - 1].discount = v(b.inArray(a[a.length - 1].manufacturer.toUpperCase(), p))))
                })
            });
            return a
        },
        t = function(h) {
            b("#list-cameras").html("");
            var f = h.ip;
            1 == m && (f = h.analog);
            2 == m && (f = h.hd);
            b.each(f.cam, function(d, e) {
                var g =
                    b(".item-type-camera-tpl").clone();
                g.removeClass("item-type-camera-tpl");
                g.attr("id", "cam_item_" + d);
                0 == d && g.addClass("first-type-line");
                var c = e.sku;
                "" != c ? c = "Артикул: " + c : b(".item-article", g).hide();
                b(".item-article", g).html(c);
                b(".item-name", g).html(e.name);
                b(".sel-cam-link", g).attr("id", "tcam_" + d);
                c = files_path + "images/products/" + e.img;
                "" == e.img && (c = no_foto_img, b(".item-img", g).hide(), b(".ci-bottom", g).addClass("no-padding-left"), g.addClass("without-photo"));
                b(".item-img",
                    g).attr("src", c);
                b(".description-text", g).html("<span>" + e.description + "</span>");
                "" == e.description && b(".more-span", g).hide();
                c = e.manufacturer;
                "" != c ? c = "Производитель: <span>" + c + "</span>" : b(".item-brend", g).hide();
                b(".item-brend", g).html(c);
                b(".item_price_span", g).val(e.price).attr("id", "camprice_" + d).attr("disabled", "true");
                c = e.youtube;
                "" == c && (b(".camera-video-sample", g).hide(), c = "#");
                b(".popup-youtube", g).attr("href", c);
                b(".calc-input",
                    g).attr("id", "cam_" + d);
                b(".calc-input", g).attr("value", e.cnt);
                b(".calc-input", g).addClass("spinner-input");
                b(".item-total-price", g).attr("id", "sumcam_" + d);
                b(".item-total-price", g).html(q(e.price, 0, " "));
                b(".item-total-price", g).html(e.total);
                b(".btn-del-line", g).attr("id", "delcam_" + d);
                b("#list-cameras").append(g);
                g.show();
                c = 560;
                b(".camera-video-sample", g).is(":visible") && (c = 440);
                b(".description-text span", g).width() < c && b(".more-span", g).hide()
            });
            0 == f.cam.length && b("#list-cameras").html('<div class="no_camera"><div class="nc-desc" style="padding:22px 0 22px 0;">Выберите камеры и их количество</div><div class="nc-desc " style="color:#ff1037; font-size:16px; padding:5px 0;">Расчет будет сформирован автоматически</div><div class="no-cam-arrow"></div></div>');
            b("#list-required-equipment").html("");
            b.each(f.required, function(d, e) {
                var c = b(".item-type-required-equipment-tpl").clone();
                c.removeClass("item-type-required-equipment-tpl");
                c.attr("id", "required_item_" + d);
                0 == d && c.addClass("first-type-line");
                var f = e.sku;
                "" != f ? f = "Артикул: " + f : b(".item-article", c).hide();
                b(".item-article", c).html(f);
                b(".item-name", c).html(e.name);
                f = files_path + "images/products/" + e.img;
                "" == e.img && (f = no_foto_img, b(".item-img", c).hide(), b(".ci-bottom",
                    c).addClass("no-padding-left"), c.addClass("without-photo"));
                b(".item-img", c).attr("src", f);
                b(".description-text", c).html("<span>" + e.description + "</span>");
                "" == e.description && b(".more-span", c).hide();
                f = e.manufacturer;
                "" != f ? f = "Производитель: <span>" + f + "</span>" : b(".item-brend", c).hide();
                b(".item-brend", c).html(f);
                b(".item_price_span", c).val(e.price).attr("id", "reqprice_" + d).attr("disabled", "true");
                f = e.youtube;
                "" == f && (f = "#", b(".camera-video-sample",
                    c).hide());
                b(".popup-youtube", c).attr("href", f);
                b(".calc-input", c).attr("id", "req_" + d);
                b(".calc-input", c).addClass("spinner-input");
                b(".calc-input", c).attr("value", e.cnt);
                b(".item-total-price", c).attr("id", "sumreq_" + d);
                b(".item-total-price", c).html(q(e.price, 0, " "));
                b(".item-total-price", c).html(e.total);
                b(".btn-del-line", c).attr("id", "delreq_" + d);
                b("#list-required-equipment").append(c);
                c.show();
                f = 560;
                b(".camera-video-sample", c).is(":visible") && (f = 440);
                b(".description-text span", c).width() < f && b(".more-span",
                    c).hide()
            });
            b("#list-optional-equipment").html("");
            b.each(f.additional, function(d, e) {
                var c = b(".item-type-optional-equipment-tpl").clone();
                c.removeClass("item-type-optional-equipment-tpl");
                c.attr("id", "additional_item_" + d);
                0 == d && c.addClass("first-type-line");
                var f = e.sku;
                "" != f ? f = "Артикул: " + f : b(".item-article", c).hide();
                b(".item-article", c).html(f);
                b(".item-name", c).html(e.name);
                b(".sel-add-link", c).attr("id", "tadd_" + d);
                f = files_path + "images/products/" + e.img;
                "" == e.img &&
                    (f = no_foto_img, b(".item-img", c).hide(), b(".ci-bottom", c).addClass("no-padding-left"), c.addClass("without-photo"));
                b(".item-img", c).attr("src", f);
                b(".description-text", c).html("<span>" + e.description + "</span>");
                "" == e.description && b(".more-span", c).hide();
                f = e.manufacturer;
                "" != f ? f = "Производитель: <span>" + f + "</span>" : b(".item-brend", c).hide();
                b(".item-brend", c).html(f);
                b(".item_price_span", c).val(e.price).attr("id", "addprice_" + d).attr("disabled",
                    "true");
                f = e.youtube;
                "" == f && (f = "#", b(".camera-video-sample", c).hide());
                b(".popup-youtube", c).attr("href", f);
                b(".calc-input", c).attr("id", "add_" + d);
                b(".calc-input", c).addClass("spinner-input");
                b(".calc-input", c).attr("value", e.cnt);
                b(".item-total-price", c).attr("id", "sumadd_" + d);
                b(".item-total-price", c).html(q(e.price, 0, " "));
                b(".item-total-price", c).html(e.total);
                b(".move-up-btn", c).attr("id", "moveup_" + d);
                b(".move-down-btn", c).attr("id", "movedown_" + d);
                b(".btn-del-line", c).attr("id", "deladd_" + d);
                b("#list-optional-equipment").append(c);
                c.show();
                f = 560;
                b(".camera-video-sample", c).is(":visible") && (f = 440);
                b(".description-text span", c).width() < f && b(".more-span", c).hide()
            });
            b("#list-works").html("");
            b.each(f.works, function(d, c) {
                var e = b(".item-installation-work-line-tpl").clone();
                e.removeClass("item-installation-work-line-tpl");
                e.attr("id", "works_item_" + d);
                0 == d && e.addClass("first-type-line");
                b(".name-installation-work", e).html(c.name);
                b(".sel-wrk-link", e).attr("id", "twrk_" + d);
                b(".item_price_span", e).val(c.price).attr("id", "wrkprice_" +
                    d).attr("disabled", "true");
                b(".calc-input", e).attr("id", "wrk_" + d);
                b(".calc-input", e).addClass("spinner-input");
                b(".calc-input", e).attr("value", c.cnt);
                b(".item-total-price", e).attr("id", "sumwrk_" + d);
                b(".item-total-price", e).html(q(c.price, 0, " "));
                b(".item-total-price", e).html(c.total);
                b(".btn-del-line", e).attr("id", "delwrk_" + d);
                b("#list-works").append(e);
                e.show()
            });
            b(".spinner-input").spinner({
                mouseWheel: !1,
                step: 1,
                min: 1,
                change: I,
                stop: I,
                icons: {
                    down: "custom-down-icon",
                    up: "custom-up-icon"
                }
            });
            b(".popup-youtube, .popup-vimeo, .popup-gmaps").magnificPopup({
                disableOn: 700,
                type: "iframe",
                mainClass: "mfp-fade",
                removalDelay: 0,
                preloader: !1,
                fixedContentPos: !1
            });
            b(".sel-cam-link").click(function() {
                y = 1;
                z = b(this).attr("id");
                b.magnificPopup.open({
                    items: {
                        src: b("#wn-sel-cameras"),
                        type: "inline"
                    },
                    closeBtnInside: !0,
                    preloader: !1,
                    midClick: !0,
                    removalDelay: 0,
                    mainClass: "my-mfp-zoom-in"
                });
                return !1
            });
            b(".sel-add-link").click(function() {
                y = 1;
                z = b(this).attr("id");
                b.magnificPopup.open({
                    items: {
                        src: b("#wn-sel-additional"),
                        type: "inline"
                    },
                    closeBtnInside: !0,
                    preloader: !1,
                    midClick: !0,
                    removalDelay: 0,
                    mainClass: "my-mfp-zoom-in"
                });
                return !1
            });
            b(".btn-del-line").click(function() {
                var d = b(this).attr("id").split("_");
                switch (d[0]) {
                    case "delcam":
                        if (void 0 != f.cam[parseInt(d[1])].binding) {
                            var e = [];
                            b.each(f.cam[parseInt(d[1])].binding, function(b, c) {
                                for (k = 0; k < f.works.length; k++)
                                    if (f.works[k].id == parseInt(c)) {
                                        f.works[k].cnt <= f.cam[parseInt(d[1])].cnt ? f.works.splice(k, 1) : f.works[k].cnt -= f.cam[parseInt(d[1])].cnt;
                                        break
                                    }
                            });
                            b.each(e, function(c, d) {
                                h.works.push(b.extend({}, d))
                            })
                        }
                        f.cam.splice(parseInt(d[1]), 1);
                        b("#cam_item_" +
                            d[1]).fadeOut("fast", function() {
                            t(c);
                            u()
                        });
                        break;
                    case "delreq":
                        f.required.splice(parseInt(d[1]), 1);
                        b("#required_item_" + d[1]).fadeOut("fast", function() {
                            t(c);
                            u()
                        });
                        break;
                    case "deladd":
                        void 0 != f.additional[parseInt(d[1])].binding && (e = [], b.each(f.additional[parseInt(d[1])].binding, function(b, c) {
                            for (k = 0; k < f.works.length; k++)
                                if (f.works[k].id == parseInt(c)) {
                                    f.works[k].cnt <= f.additional[parseInt(d[1])].cnt ? f.works.splice(k, 1) : f.works[k].cnt -= f.additional[parseInt(d[1])].cnt;
                                    break
                                }
                        }), b.each(e, function(c, d) {
                            h.works.push(b.extend({},
                                d))
                        }));
                        f.additional.splice(parseInt(d[1]), 1);
                        b("#additional_item_" + d[1]).fadeOut("fast", function() {
                            t(c);
                            u()
                        });
                        break;
                    case "delwrk":
                        f.works.splice(parseInt(d[1]), 1), b("#works_item_" + d[1]).fadeOut("fast", function() {
                            t(c);
                            u()
                        })
                }
            });
            b(".move-up-btn").click(function() {
                var d = c.ip;
                1 == m && (d = c.analog);
                2 == m && (d = c.hd);
                var e = b(this).attr("id").split("_");
                e = parseInt(e[1]);
                if (0 != e && !(2 > d.additional.length)) {
                    var f = d.additional[e];
                    d.additional[e] = d.additional[e - 1];
                    d.additional[e - 1] = f;
                    t(c);
                    u()
                }
            });
            b(".move-down-btn").click(function() {
                var d =
                    c.ip;
                1 == m && (d = c.analog);
                2 == m && (d = c.hd);
                var e = b(this).attr("id").split("_");
                e = parseInt(e[1]);
                if (!(e >= d.additional.length - 1 || 2 > d.additional.length)) {
                    var f = d.additional[e];
                    d.additional[e] = d.additional[e + 1];
                    d.additional[e + 1] = f;
                    t(c);
                    u()
                }
            });
            b(".spinner-down").click(function() {
                var c = parseFloat(b(this).parent().find(".calc-input").val());
                C(c) || (c = 2);
                1 < c && b(this).parent().find(".calc-input").val(--c);
                B(b(this).parent().find(".calc-input").attr("id"), c)
            });
            b(".spinner-up").click(function() {
                var c = parseFloat(b(this).parent().find(".calc-input").val());
                C(c) || (c = 0);
                b(this).parent().find(".calc-input").val(++c);
                B(b(this).parent().find(".calc-input").attr("id"), c)
            });
            b(".calc-input").change(function() {
                B(b(this).attr("id"), b(this).val())
            });
            b(".calc-input").keyup(function() {
                B(b(this).attr("id"), b(this).val())
            });
            b(".more-span").click(function() {
                b(this).hasClass("turn-span") ? (b(this).parent().find(".description-text").removeClass("dst-full", 300), b(this).removeClass("turn-span"), b(this).html("Подробнее")) : (b(this).parent().find(".description-text").addClass("dst-full",
                    300), b(this).addClass("turn-span"), b(this).html("Свернуть"))
            })
        },
        I = function() {
            var c = parseFloat(b(this).parent().find(".calc-input").val());
            C(c) || (c = 0);
            b(this).parent().find(".calc-input").val(c);
            B(b(this).parent().find(".calc-input").attr("id"), c)
        },
        C = function(b) {
            return isNaN(b) || !jQuery.isNumeric(b) || 0 >= b ? !1 : !0
        },
        B = function(h, f) {
            var d = c.ip;
            1 == m && (d = c.analog);
            2 == m && (d = c.hd);
            var e = h.split("_");
            b("#" + h).removeClass("input-error");
            if (C(f)) {
                switch (e[0]) {
                    case "cam":
                        d.cam[parseInt(e[1])].cnt =
                            parseInt(f);
                        d.additional = x(d);
                        1 == parseInt(b("input[name=installation-radio]:checked").val()) && (d.works = w(d));
                        t(c);
                        break;
                    case "req":
                        d.required[parseInt(e[1])].cnt = parseInt(f);
                        H(d);
                        break;
                    case "add":
                        d.additional[parseInt(e[1])].cnt = parseInt(f);
                        H(d);
                        break;
                    case "wrk":
                        d.works[parseInt(e[1])].cnt = parseInt(f)
                }
                u()
            } else b("#" + h).addClass("input-error")
        },
        u = function() {
            M();
            for (var c = 0; 3 > c; c++) c != m && J(c);
            J(m);
            N();
            b(".loading").hide()
        },
        J = function(h) {
            var f = 0,
                d = 0,
                e = 0,
                g = c.ip;
            1 == h && (g = c.analog);
            2 == h && (g = c.hd);
            b(".spinner-input").spinner("enable");
            b(".sel-wrk-link").removeClass("disabled");
            b.each(g.cam, function(c, f) {
                f.sum = (100 - f.discount) / 100 * f.price * f.cnt;
                e += f.cnt * f.price - f.sum;
                b("#sumcam_" + c).html(q(f.sum, 0, " "));
                d += f.sum
            });
            b(".total_cam").html(q(d, 0, " "));
            b(".camera-discount").hide();
            0 != e && (b(".camera-discount").show(), b("#camera-discount-id").html(q(e, 0, " ")));
            g.cam_discount = e;
            f += d;
            g.cam_total = d;
            e = d = 0;
            b.each(g.required, function(c, e) {
                e.sum = e.cnt * e.price;
                b("#sumreq_" + c).html(q(e.sum, 0, " "));
                d += e.sum
            });
            b(".total_req").html(q(d, 0, " "));
            f +=
                d;
            g.req_total = d;
            e = d = 0;
            b.each(g.additional, function(c, f) {
                f.sum = (100 - f.discount) / 100 * f.price * f.cnt;
                e += f.cnt * f.price - f.sum;
                b("#sumadd_" + c).html(q(f.sum, 0, " "));
                d += f.sum
            });
            b(".total_add").html(q(d, 0, " "));
            b(".equipment-discount").hide();
            0 != e && (b(".equipment-discount").show(), b("#equipment-discount-id").html(q(e, 0, " ")));
            f += d;
            g.add_total = d;
            g.add_discount = e;
            var l = e = d = 0,
                p = 0;
            b.each(g.works, function(c, f) {
                isNaN(f.rate) ? (f.sum = (100 - f.discount) / 100 * f.price * f.cnt, e += f.cnt * f.price - f.sum) : (l = f.rate, p = c, f.sum = 0);
                b("#sumwrk_" + c).html(q(f.sum, 0, " "));
                d += f.sum
            });
            0 != l && (g.works[p].sum = l / 100 * d, g.works[p].price = l / 100 * d, d += g.works[p].sum, b("#sumwrk_" + p).html(q(g.works[p].sum, 0, " ")), b("#wrkprice_" + p).val(q(g.works[p].sum, 0, "")).attr("readonly", ""), b("#wrk_" + p).spinner("disable"), b("#twrk_" + p).addClass("disabled"));
            b(".total_works").html(q(d, 0, " "));
            b(".installation-discount").hide();
            0 != e && (b(".installation-discount").show(), b("#installation-discount-id").html(q(e, 0, " ")));
            f += d;
            g.wrk_total = d;
            g.wrk_discount = e;
            g.total =
                f;
            0 < f ? b("#send_order_bottom").show() : b("#send_order_bottom").hide();
            h == m && (b(".total_sum").html(q(f, 0, " ")), b("#camera-sum-span").html(q(g.cam_total, 0, " ")), b("#equipment-sum-span").html(q(g.add_total, 0, " ")), b("#installation-sum-span").html(q(g.wrk_total, 0, " ")), 0 == g.cam.length ? b("#total-camera-amount").parent().hide() : b("#total-camera-amount").parent().show(), b("#total-camera-amount").html(g.cam.length + " " + D(g.cam.length, ["наименование",
                    "наименования", "наименований"
                ])), 0 == g.additional.length ? b("#total-equipment-amount").parent().hide() : b("#total-equipment-amount").parent().show(), b("#total-equipment-amount").html(g.additional.length + " " + D(g.additional.length, ["наименование", "наименования", "наименований"])),
                0 == g.works.length ? b("#total-installation-amount").parent().hide() : b("#total-installation-amount").parent().show(), b("#total-installation-amount").html(g.works.length + " " + D(g.works.length, ["наименование", "наименования", "наименований"])), h = g.cam.length + g.additional.length + g.works.length, 0 == h ? b(".result-d2").hide() : b(".result-d2").show(),
                b("#total-sumitem-span").html(h + " " + D(h, ["наименование", "наименования", "наименований"])), b(".total_sum").html(q(f, 0, " ")), b(".equipment-sum-span").html(q(g.cam_total + g.add_total, 0, " ")), b(".installation-sum-span").html(q(g.wrk_total, 0, " ")), b(".cpan-discount-num").html(r[19][m].rate + "%"), b("#inst_full_price").html(q(g.wrk_total +
                    g.wrk_discount, 0, " ") + " " + currency))
        },
        D = function(b, c) {
            var d = b % 100,
                e = b % 10;
            return 10 < d && 20 > d ? c[2] : 1 < e && 5 > e ? c[1] : 1 == e ? c[0] : c[2]
        },
        A = function(b, c, d, e) {
            return b.val().length > e || b.val().length < d ? (b.addClass("calc-error"), !1) : !0
        },
        G = function(b, c, d) {
            if (c.test(b.val())) return !0;
            b.addClass("calc-error");
            return !1
        },
        v = function(b) {
            return r[19][3 + b].rate
        },
        M = function() {
            var h = c.ip;
            1 == m && (h = c.analog);
            2 == m && (h = c.hd);
            h.discount_eq = v(m);
            h.discount_wr = r[19][m].rate;
            b.each(h.cam, function(c, d) {
                d.discount = 0; - 1 != b.inArray(d.manufacturer.toUpperCase(),
                    p) && (d.discount = v(b.inArray(d.manufacturer.toUpperCase(), p)))
            });
            b.each(h.additional, function(c, d) {
                d.discount = 0; - 1 != b.inArray(d.manufacturer.toUpperCase(), p) && (d.discount = v(b.inArray(d.manufacturer.toUpperCase(), p)))
            });
            b.each(h.works, function(b, c) {
                c.discount = r[19][m].rate
            })
        },
        O = function(c, f, d, e, g) {
            g.manager = r[18][0];
            b("#sel_order_msg").hide();
            b("#form-loading").show();
            b("#order-btn").hide();
            b.post(files_path + "calc.php", {
                data: JSON.stringify(g),
                name: c,
                phone: f,
                email: d,
                comment: e
            }, function(c) {
                c.success ?
                    (b("#form_popup_order").hide(), b("#form_message").attr("class", "alert alert-success"), b("#form_message").show(), b("#order-form").hide()) : (b("#form_message").attr("class", "alert alert-error"), b("#form_message").show());
                b("#form_message").html(c.message);
                b("#form_message").show();
                b("#form-loading").hide();
                b("#order-btn").show();
                return c
            }, "json").error(function() {
                b("#calc_messagebox").hide();
                b("#calc_message").html("Произошла ошибка при получении данных с сервера. Повторите попытку позже.");
                b("#calc_messagebox").fadeIn("slow");
                b("#form-loading").hide();
                b("#order-btn").show()
            });
            return !1
        };
    b("#order_btn").click(function() {
        var h = b("#name_input"),
            f = b("#email_input"),
            d = b("#phone_input"),
            e = !0;
        b([]).add(h).add(f).add(d).removeClass("calc-error");
        (e = (e = (e = (e = e && A(h, "name", 2, 16)) && A(f, "email", 6, 80)) && A(d, "phone", 4, 30)) && G(f, /^((([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+(\.([a-z]|\d|[!#\$%&'\*\+\-\/=\?\^_`{\|}~]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])+)*)|((\x22)((((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(([\x01-\x08\x0b\x0c\x0e-\x1f\x7f]|\x21|[\x23-\x5b]|[\x5d-\x7e]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(\\([\x01-\x09\x0b\x0c\x0d-\x7f]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF]))))*(((\x20|\x09)*(\x0d\x0a))?(\x20|\x09)+)?(\x22)))@((([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|\d|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.)+(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])|(([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])([a-z]|\d|-|\.|_|~|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])*([a-z]|[\u00A0-\uD7FF\uF900-\uFDCF\uFDF0-\uFFEF])))\.?$/i,
            "")) && O(h.val(), d.val(), f.val(), b("#comment").val(), c);
        return !1
    });
    b(".bucket-checkout").click(function() {
        b("#form_popup_order").show();
        b("#form_message").html("");
        b("#form_message").hide();
        b("#form_message").attr("class", "")
    });
    var N = function() {
            var h = {
                i: [],
                a: []
            };
            b.each(c.ip.cam, function(b, c) {
                h.i.push({
                    id: c.id - 1,
                    gid: c.gid,
                    t: c.type - 1,
                    c: c.cnt
                })
            });
            b.each(c.analog.cam, function(b, c) {
                h.a.push({
                    id: c.id - 1,
                    gid: c.gid,
                    t: c.type - 1,
                    c: c.cnt
                })
            });
            h.w = b("input[name=installation-radio]").val();
            JSON.stringify(h)
        },
        L = function(h) {
            h =
                b.parseJSON(b.base64.decode(h));
            void 0 != h && (E(), m = 0, void 0 != h.t && (m = parseInt(h.t)), void 0 != h.i && (c.ip.cam = [], b.each(h.i, function(f, d) {
                c.ip.cam.push(b.extend({}, r[d.t][d.gid][d.id]));
                c.ip.cam[c.ip.cam.length - 1].cnt = parseInt(d.c);
                c.ip.cam[c.ip.cam.length - 1].discount = 0
            }), c.ip.additional = [], c.ip.works = [], c.ip.additional = x(c.ip), 1 == parseInt(h.w) ? c.ip.works = w(c.ip) : b("#installation-radio-id1").attr("checked", "checked")), void 0 != h.a && (c.analog.cam_type = 1, c.analog.cam = [], b.each(h.a, function(f, d) {
                c.analog.cam.push(b.extend({},
                    r[d.t][d.gid][d.id]));
                c.analog.cam[c.analog.cam.length - 1].cnt = d.c;
                c.analog.cam[c.analog.cam.length - 1].discount = 0
            }), c.analog.additional = [], c.analog.works = [], c.analog.additional = x(c.analog), 1 == parseInt(h.w) ? c.analog.works = w(c.analog) : b("#installation-radio-id1").attr("checked", "checked")), void 0 != h.h && (c.hd.cam_type = 2, c.hd.cam = [], b.each(h.h, function(f, d) {
                c.hd.cam.push(b.extend({}, r[d.t][d.gid][d.id]));
                c.hd.cam[c.hd.cam.length - 1].cnt = d.c;
                c.hd.cam[c.hd.cam.length - 1].discount = 0
            }), c.hd.additional = [], c.hd.works = [], c.hd.additional = x(c.hd), 1 == parseInt(h.w) ? c.hd.works = w(c.hd) : b("#installation-radio-id1").attr("checked", "checked")), b(".type-cctv").removeClass("active"), 0 == m && b("#cctv_ip").click(), 1 == m && b("#cctv_analog").click(), 2 == m && b("#cctv_hd").click(), t(c), u())
        }
});